[
    {
        "id": "d268d729-0895-4714-9959-c383f3494de6",
        "category": "Meat",
        "image": "https://cooksimply.co.uk/wp-content/uploads/2023/03/poached-Chinese-chicken-Cook-Simply.jpg",
        "directions": [
            "Poach chicken: In a 1 1/2-quart saucepan bring water to a boil with gingerroot, Scotch, and salt to taste. Add chicken and simmer, covered, 12 minutes, or until just cooked through. Transfer chicken with tongs to a bowl and chill, covered, 20 minutes.",
            "Make sauce while chicken is cooling: In a bowl stir together sauce ingredients until sugar is dissolved.",
            "Halve chicken and cut across grain into thin slices. Spoon sauce over chicken and sprinkle with coriander."
        ],
        "ingredients": [
            "2 cups water",
            "four 1/4-inch-thick slices fresh gingerroot",
            "1/4 cup Scotch",
            "1 whole skinless boneless chicken breast (about 3/4 pound)",
            "1 tablespoon soy sauce",
            "2 garlic cloves, minced",
            "1 1/2 teaspoons rice vinegar (not seasoned)",
            "1 1/4 teaspoons sugar",
            "1 teaspoon Asian chili oil, or",
            "1 teaspoon Asian sesame oil",
            "plus Tabasco to taste",
            "Garnish: 3 tablespoons chopped coriander sprigs",
            "Accompaniment if desired:sesame orzo with charred scallions"
        ],
        "language": "en-US",
        "source": "www.epicurious.com",
        "tags": [
            "Scotch",
            "Chicken",
            "Garlic",
            "Ginger",
            "Poach",
            "Quick & Easy",
            "Lunch",
            "Summer",
            "Chill",
            "Sesame",
            "Gourmet",
            "Sugar Conscious",
            "Dairy Free",
            "Peanut Free",
            "Tree Nut Free",
            "Kosher"
        ],
        "title": "Cold Poached Chicken with Chinese Garlic Sauce",
        "url": "http://www.epicurious.com/recipes/food/views/cold-poached-chicken-with-chinese-garlic-sauce-12443"
    },
    {
      "id": "0cda0f82-5e84-4ad2-8af2-de95ad4ab424",
      "category": "Meat",
      "image": "https://www.hwcmagazine.com/wp-content/uploads/2022/06/tea-smoked-chicken-legs-on-grill-7340.jpg",
      "directions": [
        "Boil 2 cups water, star anise, ginger, and zest in a 1-quart saucepan, covered, 5 minutes, then cool infusion, uncovered, to room temperature, about 30 minutes.",
        "Stir together kosher salt, Insta Cure, and remaining 4 cups water in storage tub until solids are dissolved, about 3 minutes, then add brown sugar, soy sauce, hoisin sauce, and cooled infusion (with solids). Add ice and stir until cure is cold (ice may not melt completely; keeping liquid cold slows salt absorption).",
        "Add chicken to cure and weight down with a large plate (to keep submerged). Chill, tub covered with a lid or plastic wrap, 4 to 6 hours.",
        "Rinse chicken and pat dry, then discard brine.",
        "Open vents on bottom of grill and on lid. Remove lid and top rack from grill, then center disposable roasting pan on lower rack and add 1 1/2 cups sawdust to pan.",
        "Light 6 charcoal briquettes in chimney starter. When briquettes are fully lit (covered completely with gray ash and glowing), transfer with tongs to sawdust, spacing evenly.",
        "When sawdust begins to smolder, replace top rack and arrange chicken legs on rack about 1 inch apart. Cover grill with lid, then insert thermometer into a vent hole in lid to monitor air temperature, which should be 80 to 120°F. (If temperature rises above 120°F, remove 1 or more briquettes or uncover grill slightly until temperature falls. If temperature falls below 80°F or sawdust stops burning, light 1 more briquette and add to sawdust.)",
        "Smoke chicken, adding 1 1/2 cups sawdust to roasting pan and stirring with tongs every 1 1/2 hours to ignite unburned sawdust, 6 hours. (Chicken will not be cooked.)",
        "Put oven rack in middle of oven and preheat oven to 350°F. Lightly oil an 11- by 17-inch roasting pan. Transfer smoked chicken, skin sides up, to pan and bake until the thickest part of a thigh registers 170°F on thermometer, about 25 minutes. Cool completely, uncovered, then chill, wrapped in plastic wrap, until ready to serve."
      ],
      "ingredients": [
        "6 cups cold water",
        "4 whole star anise",
        "6 (1/8-inch-thick) slices fresh ginger",
        "1 (3- by 1/2-inch) strip fresh orange zest",
        "1 cup kosher salt",
        "2 1/2 tablespoons Insta Cure No. 1 (curing salt)",
        "1/2 cup packed dark brown sugar",
        "1/4 cup soy sauce",
        "1/4 cup hoisin sauce",
        "3 cups ice cubes",
        "5 whole chicken legs (with thighs attached; 3 lb)",
        "Special equipment: a 1- to 2-gallon plastic storage tub; a 22 1/2-inch kettle grill with a lid and a hinged top rack; a 12- by 8- by 2-inch disposable aluminum roasting pan; 6 cups hardwood sawdust (3/4 lb; not from treated wood); charcoal briquettes; a chimney starter; long metal tongs; an instant-read thermometer"
      ],
      "language": "en-US",
      "source": "www.epicurious.com",
      "tags": ["Chicken", "Poultry", "Bake", "Summer", "Soy Sauce", "Gourmet"],
      "title": "Cold-Smoked Chicken Legs in a Chinese Cure",
      "url": "http://www.epicurious.com/recipes/food/views/cold-smoked-chicken-legs-in-a-chinese-cure-232188"
    },
    {
      "id": "9c459325-194c-4c29-8163-5d00d9f2c96d",
      "category": "Meat",
      "image": "https://www.thespicehouse.com/cdn/shop/articles/Chinese_Five_Spice_Chicken_Wings_720x.jpg?v=1591370800",
      "directions": [
        "Cut off wing tips, reserving for another use, and halve wings at joint. Coarsely chop onion and finely chop gingerroot. In a large sealable plastic bag combine onion, gingerroot, soy sauce, Sherry, five-spice powder, sugar, and 1 teaspoon salt. Add wings and seal bag, pressing out excess air. Turn bag until wings are completely coated. Marinate chicken wings in bag in a large bowl, chilled, turning bag once, 2 hours.",
        "Preheat oven to 350°F.",
        "Transfer wings and marinade to a roasting pan or large shallow baking pan and bake, covered with foil, in middle of oven 1 hour. Cool wings until they can be handled and drain in a colander, discarding marinade. Wings may be prepared up to this point 1 day ahead and chilled, covered.",
        "Reduce temperature to 250°F.",
        "In a small serving bowl combine remaining 2 tablespoons salt and pepper. Put cornstarch in a small bowl and dredge each wing, knocking off excess cornstarch and transferring to a shallow pan. In a 5- to 6-quart heavy kettle heat oil until a deep-fat thermometer registers 370°F. Working in batches of 6 or 7, fry wings in oil until golden brown, about 3 minutes, and with a slotted spoon transfer to paper towels to drain. Keep wings warm on a baking sheet in oven. Fry remaining wings in same manner, returning oil to 370°F. between batches.",
        "Serve wings with salt and pepper mixture."
      ],
      "ingredients": [
        "3 pounds chicken wings (12 to 14)",
        "1 onion",
        "a 1 1/2-inch piece peeled fresh gingerroot",
        "2 tablespoons soy sauce (preferably Kikkoman)",
        "1‚ tablespoons medium-dry Sherry",
        "1 tablespoon Chinese five-spice powder",
        "1 tablespoon sugar",
        "2 tablespoons plus 1 teaspoon coarse salt",
        "2 teaspoons freshly ground black pepper, or to taste",
        "1/2 cup cornstarch",
        "6 cups vegetable oil"
      ],
      "language": "en-US",
      "source": "www.epicurious.com",
      "tags": [
        "Chicken",
        "Appetizer",
        "Braise",
        "Fry",
        "Marinate",
        "Cocktail Party",
        "Super Bowl",
        "Poker/Game Night",
        "Party",
        "Gourmet"
      ],
      "title": "Fried Chinese Five-Spice Chicken Wings",
      "url": "http://www.epicurious.com/recipes/food/views/fried-chinese-five-spice-chicken-wings-101930"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba674828e6",
      "category": "Vegetable",
      "image": "https://omnivorescookbook.com/wp-content/uploads/2022/01/220107_Chinese-Fried-Stuffed-Eggplant_1.jpg",
      "directions": [
        "Cut off 1 1/2 inches from bottom of eggplant and discard. Move knife 1/4 inch from cut side and cut almost but not all the way through eggplant (this is the pocket). Move knife 1/4 inch from pocket cut and cut slice free from eggplant. Make 7 more slices with pockets in same manner.",
        "Stir together pork, scallion, ginger, soy sauce, and salt in a bowl with a fork. Spread 1 tablespoon filling in each eggplant pocket.",
        "Heat 1/2 inch oil in a 10-inch heavy skillet over moderate heat until it registers 360°F on thermometer (see cooks' note, below).",
        "Meanwhile, whisk together flour, egg, and water in a bowl until batter is smooth. Dip 4 eggplant slices, 1 at a time, into batter, shaking off excess to leave a thin coating, and fry, turning over once, until eggplant is tender when pierced with a fork and batter is pale golden, 4 to 5 minutes total. Transfer to paper towels to drain. Return oil to 360°F, then coat and fry remaining 4 slices in same manner. Drain briefly on paper towels and serve immediately."
      ],
      "ingredients": [
        "1 (9-inch) eggplant (about 3 inches wide; 1 1/4 lb)",
        "1/4 lb ground pork (not lean)",
        "2 tablespoons finely chopped scallion greens",
        "1 teaspoon minced peeled fresh ginger",
        "1 1/2 tablespoons soy sauce",
        "1/4 teaspoon salt",
        "3 to 4 cups peanut or vegetable oil for frying",
        "1 cup all-purpose flour",
        "1 large egg, lightly beaten",
        "3/4 cup water",
        "Special equipment: a deep-fat thermometer"
      ],
      "language": "en-US",
      "source": "www.epicurious.com",
      "tags": [
        "Pork",
        "Vegetable",
        "Appetizer",
        "Side",
        "Fry",
        "Eggplant",
        "Deep-Fry",
        "Gourmet",
        "Dairy Free",
        "Tree Nut Free",
        "No Sugar Added"
      ],
      "title": "Fried Stuffed Chinese Eggplant",
      "url": "http://www.epicurious.com/recipes/food/views/fried-stuffed-chinese-eggplant-231783"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba674828e7",
      "category": "Meat",
      "image": "https://jewcanque.com/wp-content/uploads/2022/10/FullSizeRender-56-1664x2048.jpg",
      "directions": [
        "Whisk wine, soy sauce, garlic, and 1 teaspoon dry mustard in large glass baking dish. Add tri-tip and turn to coat with marinade. Let stand at room temperature 30 minutes, turning meat occasionally.",
        "Meanwhile, whisk honey, 2 tablespoons water, 1/4 teaspoon salt, and remaining 2 tablespoons dry mustard in small bowl to blend; set sauce aside.",
        "Preheat oven to 450°F. Remove tri-tip from marinade; pat dry with paper towels. Place tri-tip on large rimmed baking sheet; sprinkle with salt and pepper. Arrange green onions and mushrooms around meat; drizzle onions and mushrooms with olive oil. Roast 12 minutes. Turn meat, onions, and mushrooms over; roast until vegetables are tender and instant-read thermometer inserted into center of meat registers 125°F for medium-rare, about 12 minutes longer.",
        "Place mushrooms and green onions on platter. Cut meat into 1/4-inch-thick slices; arrange atop green onions and mushrooms. Pour any pan juices over. Drizzle lightly with mustard sauce. Serve, passing remaining mustard sauce alongside."
      ],
      "ingredients": [
        "1/3 cup dry red wine",
        "2 tablespoons soy sauce",
        "3 garlic gloves, minced",
        "1 teaspoon plus 2 tablespoons dry mustard",
        "1 1 1/2-pound beef tri-tip roast",
        "2 tablespoons honey",
        "2 tablespoons water",
        "1/4 teaspoon salt",
        "3 bunches green onions, root ends trimmed, dark green tops cut off and discarded",
        "1 pound or three 6-ounce packages baby portobello mushrooms",
        "2 tablespoons olive oil"
      ],
      "language": "en-US",
      "source": "www.epicurious.com",
      "tags": [
        "Beef",
        "Garlic",
        "Mushroom",
        "Mustard",
        "Onion",
        "Roast",
        "Father's Day",
        "Dinner",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free"
      ],
      "title": "Marinated Tri-Tip with Chinese Mustard Sauce and Roasted Green Onions and Mushrooms",
      "url": "http://www.epicurious.com/recipes/food/views/marinated-tri-tip-with-chinese-mustard-sauce-and-roasted-green-onions-and-mushrooms-237321"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba674828e8",
      "category": "Appetizer",
      "image": "https://www.foodandwine.com/thmb/a-zzSARazJ1-HoofFDL7LXlSikQ=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/FAW-recipes-dill-pickles-step-04-943ac215aa0a464f9ec21fd3606898a4.jpg",
      "directions": [
        "Combine the cucumbers and onions in a medium bowl and salt them generously. They should be as salty as you want your final pickles—about as salty as a potato chip. Add the garlic, dill, and spices and toss to mix. Cover the bowl tightly with plastic wrap and refrigerate overnight.",
        "The next day, drain off any liquid that has leached out of the onions and cucumbers. Douse the vegetables with the white vinegar and marinate, covered, for 3 to 4 hours in the fridge.",
        "Drain off the vinegar and store the pickles, covered, in the fridge. They’ll last for a week. Add more chopped dill before serving."
      ],
      "ingredients": [
        "1 pound Persian or Kirby cucumbers, cut into 1/4-inch-thick coins",
        "1/2 white onion, sliced (about 2/3 cup)",
        "About 1 tablespoon kosher salt",
        "1 garlic clove, minced",
        "2 sprigs fresh dill, leaves picked and chopped, plus additional for garnish",
        "1 1/2 teaspoons whole black peppercorns",
        "1 1/2 teaspoons fennel seeds",
        "1 teaspoon red pepper flakes",
        "1 cup distilled white vinegar"
      ],
      "language": "en-US",
      "source": "www.epicurious.com",
      "tags": [
        "HarperCollins",
        "Pickles",
        "Cucumber",
        "Spice",
        "Onion",
        "Dill",
        "Vinegar"
      ],
      "title": "Dill Pickles",
      "url": "http://www.epicurious.com/recipes/food/views/mission-chinese-dill-pickles"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba674828e9",
      "category": "Vegetable",
      "image": "https://www.chinasichuanfood.com/wp-content/uploads/2018/12/pan-fried-tofu-with-fermented-black-beans-8.jpg",
      "directions": [
        "Rinse the tofu, then cut crosswise into 6 slices. Put slices between several layers of paper towels and let drain while making the sauce. (You’ll likely have to replace the paper towels at least once.)",
        "Prep the seasonings for the sauce: Peel the garlic cloves and the ginger, then quarter the ginger. Turn on your food processor and drop the garlic and ginger through the feed tube; they’ll be minced in no time. Stop the machine and the black beans in a small sieve until the water runs clear. Add them to the food processor and pulse until coarsely chopped.",
        "For the liquid portion of the sauce, stir together the water, soy sauce, Sherry, maple syrup, vinegar, and the cornstarch until the cornstarch is evenly suspended. Now you’re ready to cook the sauce!",
        "Generously film the bottom of a heavy 2-quart saucepan with the vegetable oil and heat over moderately high heat until hot but not smoking. Stir-fry the seasonings until fragrant, less than a minute. Stir the cornstarch mixture and add it to the pan. Whisk the sauce occasionally while bringing it to a boil and simmer 1 minute. Then set the sauce aside while you fry the tofu.",
        "Generously film the bottom of a 12-inch nonstick skillet with vegetable oil and heat over high heat until hot but not smoking. Blot up any excess moisture on the tofu with a paper towel before laying in the skillet. Fry the slices on all sides (forgo the short ends), turning them only when the undersides are golden and crisp, 5 to 8 minutes total. (You may need to lower the heat as the frying progresses.) Give the tofu one last flip on a paper towel to sop up any stray oil and reheat the sauce.",
        "Serve with rice and broccoli, pouring sauce over all."
      ],
      "ingredients": [
        "1-pound block of extra-firm tofu",
        "4 garlic cloves",
        "1-inch chunk of fresh ginger",
        "2 tablespoons Chinese fermented black beans",
        "11/2 cups water",
        "4 tablespoons soy sauce",
        "3 tablespoons Sherry (dry or sweet)",
        "1 tablespoon maple syrup",
        "2 teaspoons cider vinegar",
        "1 1/2 tablespoons cornstarch",
        "vegetable oil"
      ],
      "language": "en-US",
      "source": "www.epicurious.com",
      "tags": [
        "Bean",
        "Garlic",
        "Ginger",
        "Vegetarian",
        "Tofu",
        "Pan-Fry",
        "Gourmet"
      ],
      "title": "Panfried Tofu with Chinese Black Bean Sauce",
      "url": "http://www.epicurious.com/recipes/food/views/panfried-tofu-with-chinese-black-bean-sauce-103384"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba674828ea",
      "category": "Seafood",
      "image": "https://iheartumami.com/wp-content/uploads/2020/01/Cod-recipe-Chinese-steamed-fish-I-Heart-Umami.jpg",
      "directions": [
        "In a bowl whisk together the scallion, the soy sauce, the vinegar, the gingerroot, the vegetable oil, 1 tablespoon of the sesame oil, the sugar, the garlic paste, the red pepper flakes, and salt and pepper to taste. In a shallow dish arrange the scrod fillets in one layer, pour the soy sauce mixture over them, and let the fish marinate, covered and chilled, for 30 minutes.",
        "Put a bamboo steamer in a wok and add enough water to the wok to allow the bottom rim of the steamer to sit in the water but the tray to remain above it. (Alternatively, arrange a steamer rack in a wide deep kettle and add water to the kettle to reach just below the steamer rack.) Bring the water to a boil. Line the steamer with the cabbage or with a plate, such as a glass pie plate, at least 1 inch smaller in diameter than the steamer, arrange the fillets, folded into thirds, skinned sides up and seam sides down, on the cabbage, and pour the marinade evenly over them. Steam the fish, covered, over the boiling water for 8 to 12 minutes, or until it just flakes, and with oven mitts remove the steamer from the wok. Transfer the fillets carefully to a heated platter and drizzle them with the remaining 1 teaspoon sesame oil."
      ],
      "ingredients": [
        "1/2 cup thinly sliced scallion",
        "1/4 cup soy sauce",
        "2 tablespoons rice-wine vinegar (available at Oriental markets) or white-wine vinegar",
        "a 1 1/2-inch piece of peeled fresh gingerroot, cut into very fine julienne strips",
        "2 tablespoons vegetable oil",
        "1 tablespoon Oriental sesame oil plus 1 teaspoon for drizzling the fish",
        "2 teaspoons sugar",
        "2 garlic cloves, minced and mashed to a paste with a pinch of salt",
        "1/4 to 1/2 teaspoon dried hot red pepper flakes, or to taste",
        "six 6-ounce scrod fillets",
        "cabbage or romaine leaves for lining the steamer if desired"
      ],
      "language": "en-US",
      "source": "www.epicurious.com",
      "tags": [
        "Wok",
        "Fish",
        "Ginger",
        "Marinate",
        "Steam",
        "Chill",
        "Gourmet"
      ],
      "title": "Steamed Scrod Fillets Chinese Style",
      "url": "http://www.epicurious.com/recipes/food/views/steamed-scrod-fillets-chinese-style-11939"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba674828eb",
      "category": "Meat",
      "image": "https://thewoksoflife.com/wp-content/uploads/2015/03/sticky-rice-chinese-sausage-7.jpg",
      "directions": [
        "Cover rice with cold water by 1 inch in a bowl and soak at least 4 and up to 12 hours.",
        "After rice has soaked at least 3 hours, fill wok with enough water for bottom rim of steamer (not rack) to rest in water, then bring to a boil.",
        "Put scallops and rice wine in a small heatproof bowl. Put bowl with scallops in bottom tier of steamer and steam, covered, until soft, about 2 hours. (Replenish water as necessary to keep bottom rim of steamer in water to prevent scorching.)",
        "When scallops have steamed for almost 1 hour, line bottom and side of top tier of steamer with several layers of cheesecloth, then set tier onto steamer in wok.",
        "Drain rice in a sieve and rinse well under cold running water, then spread rice in an even layer over cheesecloth in steamer (cheesecloth should not hang over edge of steamer) and steam, covered, sprinkling rice with a few drops of water occasionally, 1 hour. (Replenish water as necessary to keep bottom rim of steamer in water to prevent scorching.)",
        "Meanwhile, soak mushrooms in 2 cups boiling-hot water in a bowl (water should cover mushrooms), turning mushrooms over occasionally, until softened, about 30 minutes. Cut out and discard stems from mushrooms, then squeeze excess liquid from caps into bowl and thinly slice caps. Reserve 1/2 cup mushroom- soaking liquid and discard remainder.",
        "Remove top tier of steamer from wok and transfer rice from cheesecloth to a platter. Once rice has cooled, lightly wet your hands and break up large clumps.",
        "Using tongs, remove bowl containing scallops from bottom tier of steamer. Reserve water in wok.",
        "Reserve scallop-soaking liquid and shred scallops into \"threads\" with a fork or your fingers, discarding tough muscle on side (muscle will remain solid but scallop meat will shred easily).",
        "Bring water in wok to a boil, then arrange sausages on a heatproof plate and steam in steamer, covered, 5 minutes. When cool enough to handle, halve sausages lengthwise, then cut diagonally into 1/4-inch-thick slices.",
        "Cut scallions into 1/4-inch-thick slices, keeping pale green and white parts separate from dark green parts.",
        "Stir together oyster sauce, soy sauce, sugar, and salt in a bowl until sugar is dissolved.",
        "Pour off water from wok and dry. Heat wok over high heat until a bead of water vaporizes within 1 to 2 seconds of contact. Pour peanut oil down side of wok, then swirl oil, tilting wok to coat sides. Add mushrooms and pale green and white parts of scallions and stir-fry 1 minute. Add sausage and scallops and stir-fry 1 minute. Add rice and stir-fry, breaking up any clumps, 1 minute. Add scallop- and mushroom-soaking liquids along with oyster sauce mixture and stir-fry until rice is well coated and hot, about 2 minutes. Add sesame oil, then add pepper and remaining scallion greens and stir-fry until combined well."
      ],
      "ingredients": [
        "2 1/2 cups Chinese or Japanese short-grain sticky (\"sweet\") rice",
        "6 to 8 (1-inch-wide) large dried scallops",
        "1/2 cup Chinese rice wine such as Shaoxing or medium-dry Sherry",
        "12 to 15 Chinese dried black mushrooms",
        "4 links Cantonese sweet sausage",
        "2 bunches of scallions",
        "1/4 cup oyster sauce (preferably premium)",
        "2 tablespoons light soy sauce",
        "1 tablespoon sugar",
        "1 teaspoon kosher salt",
        "1/4 cup peanut oil",
        "2 tablespoons Asian sesame oil",
        "2 teaspoons black pepper",
        "Special equipment: a well-seasoned 14-inch wok, preferably flat-bottomed; a 10-inch bamboo steamer with 2 tiers; cheesecloth"
      ],
      "language": "en-US",
      "source": "www.epicurious.com",
      "tags": [
        "Wok",
        "Pork",
        "Rice",
        "Shellfish",
        "Side",
        "Steam",
        "Stir-Fry",
        "Sausage",
        "Scallop",
        "Gourmet",
        "Sugar Conscious",
        "Dairy Free",
        "Tree Nut Free"
      ],
      "title": "Sticky Rice with Chinese Sausage and Dried Scallops",
      "url": "http://www.epicurious.com/recipes/food/views/sticky-rice-with-chinese-sausage-and-dried-scallops-231372"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba674828ec",
      "category": "Noodle",
      "image": "https://assets.wsimgs.com/wsimgs/ab/images/dp/recipe/202331/0054/img32l.jpg",
      "directions": [
        "Cut the beef across the grain into 1/4-inch slices. In a bowl, combine 2 Tbs. of the tamari and 3/4 tsp. of the sugar and stir to dissolve. Mix in half of the green onions, 1 1/2 tsp. of the sesame oil and a generous amount of black pepper. Add the beef and stir to coat. Set aside.",
        "In a food processor, combine the peanut butter, ginger, vinegar, red pepper flakes, the remaining 3 Tbs. tamari, the remaining green onions, 1 Tbs. of the sesame oil and the remaining 1 tsp. sugar. Add the hot water and process until well blended to make a sauce.",
        "Meanwhile, bring a large pot of salted water to a boil over high heat. Add the spaghetti and stir well. Cook, stirring frequently, until al dente, about 8 minutes. Drain, rinse briefly with cold water and drain well. Place in a warmed bowl. Add the remaining 1 Tbs. sesame oil and stir to coat. Stir in the bell pepper and sauce to taste. Stir to coat the noodles, then season with salt and black pepper.",
        "In a large, heavy fry pan over high heat, warm the vegetable oil. Working in batches, sear the beef in a single layer, about 20 seconds per side. Transfer to a cutting board and cut each piece in half lengthwise. Divide the noodles among 4 bowls, top with the beef and sprinkle with the cilantro. Serve immediately. Serves 4.",
        "Adapted from Williams-Sonoma",
        "Weeknight Gluten Free,",
        "by Kristine Kidd (Weldon Owen, 2013)."
      ],
      "ingredients": [
        "3/4 lb. boneless beef top sirloin, trimmed, halved lengthwise\n  and partially frozen",
        "5 Tbs. gluten-free tamari",
        "1 3/4 tsp. sugar",
        "4 green onions, minced",
        "1 1/2 tsp. plus 2 Tbs. Asian sesame oil",
        "Freshly ground black pepper, to taste",
        "1/3 cup creamy old fashioned-style peanut butter",
        "2 Tbs. minced fresh ginger",
        "2 Tbs. balsamic vinegar",
        "1/2 tsp. red pepper flakes",
        "1/4 cup hot water",
        "Kosher salt, to taste",
        "10 oz. gluten-free spaghetti, such as Schar",
        "1 large red bell pepper, halved lengthwise and seeded, then\n  halved crosswise and cut into very thin slices",
        "1 Tbs. vegetable oil",
        "1/4 cup chopped fresh cilantro"
      ],
      "language": "en-US",
      "source": "www.williams-sonoma.com",
      "tags": [],
      "title": "Chinese-Style Peanut Noodles with Seared Beef",
      "url": "http://www.williams-sonoma.com/recipe/chinese-peanut-noodles-with-beef.html"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba674828ed",
      "category": "Meat",
      "image": "https://sweetpeasandsaffron.com/wp-content/uploads/2019/05/bbq-chicken-lettuce-wraps-6.jpg",
      "directions": [
        "Remove tough stems from mushrooms and brush with damp towel to clean, Slice mushrooms. Chop chicken into small pieces.",
        "Preheat a large skillet or wok to high.",
        "Add oil to hot pan. Add chicken to the pan and sear meat by stir frying a minute or 2. Add mushrooms and cook another minute or two. Add salt and pepper to season, then garlic and ginger. Cook a minute more. Grate zest into pan, add bell pepper bits, chopped water chestnuts and scallions. Cook another minute, continuing to stir fry mixture. Add hoisin Chinese barbecue sauce and toss to coat the mixture evenly. Transfer the hot chopped barbecued chicken to serving platter and pile the quartered wedges of crisp iceberg lettuce along side. Add wedged oranges to platter to garnish. To eat, pile spoonfuls into lettuce leaves, wrapping lettuce around fillings and squeeze an orange wedge over."
      ],
      "ingredients": [
        "2 cups, 4 handfuls, fresh shiitake mushrooms",
        "1 1/3 to 1 1/2 pounds thin cut chicken breast or chicken tenders",
        "2 tablespoons light colored oil, such as vegetable oil or peanut oil",
        "Coarse salt and coarse black pepper",
        "3 cloves garlic, chopped",
        "1 inch ginger root, finely chopped or grated, optional",
        "1 orange, zested",
        "1/2 red bell pepper, diced small",
        "1 small tin, 6 to 8 ounces, sliced water chestnuts, drained and chopped",
        "3 scallions, chopped",
        "3 tablespoons hoisin, Chinese barbecue sauce, available on Asian foods aisle of market",
        "1/2 large head iceberg lettuce, core removed, head quartered",
        "Wedges of navel orange -- platter garnish"
      ],
      "language": "en-US",
      "source": "www.foodnetwork.com",
      "tags": [
        "Easy Chicken Recipes",
        "Chicken",
        "Easy Recipes",
        "Poultry Recipes",
        "Easy Appetizer",
        "Appetizer",
        "Easy Meat Dish Recipes",
        "Meat Dish Recipes",
        "Asian Appetizer",
        "Asian",
        "Wok Recipes",
        "Chinese Recipes",
        "Vegetable",
        "Water Chestnut Recipes",
        "Mushroom",
        "Lettuce Recipes",
        "Fruit",
        "Orange Recipes",
        "Nut Recipes"
      ],
      "title": "Barbecued Chinese Chicken Lettuce Wraps",
      "url": "http://www.foodnetwork.com/recipes/rachael-ray/barbecued-chinese-chicken-lettuce-wraps-recipe"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba674828ee",
      "category": "Salad",
      "image": "https://food-fanatic-res.cloudinary.com/iu/s--w8Z3ClaL--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1562344462/chinese-chicken-salad-photo.jpg",
      "directions": [
        "Preheat the oven to 350 degrees F.",
        "Place the chicken breasts on a sheet pan and rub with the skin with olive oil. Sprinkle liberally with salt and pepper. Roast for 35 to 40 minutes, until the chicken is just cooked. Set aside until cool enough to handle. Remove the meat from the bones, discard the skin, and shred the chicken in large bite-sized pieces.",
        "Blanch the asparagus in a pot of boiling salted water for 3 to 5 minutes until crisp-tender. Plunge into ice water to stop the cooking. Drain. Cut the peppers in strips about the size of the asparagus pieces. Combine the cut chicken, asparagus, and peppers in a large bowl.",
        "Whisk together all of the ingredients for the dressing and pour over the chicken and vegetables. Add the scallions and sesame seeds and season to taste. Serve cold or at room temperature."
      ],
      "ingredients": [
        "4 split chicken breasts (bone-in, skin-on)",
        "Good olive oil",
        "Kosher salt",
        "Freshly ground black pepper",
        "1/2 pound asparagus, ends removed, and cut in thirds diagonally",
        "1 red bell pepper, cored and seeded",
        "2 scallions (white and green parts), sliced diagonally",
        "1 tablespoon white sesame seeds, toasted",
        "1/2 cup vegetable oil",
        "1/4 cup good apple cider vinegar",
        "3 tablespoons soy sauce",
        "1 1/2 tablespoons dark sesame oil",
        "1/2 tablespoon honey",
        "1 clove garlic, minced",
        "1/2 teaspoon peeled, grated fresh ginger",
        "1/2 tablespoon sesame seeds, toasted",
        "1/4 cup smooth peanut butter",
        "2 teaspoons kosher salt",
        "1/2 teaspoon freshly ground black pepper"
      ],
      "language": "en-US",
      "source": "www.foodnetwork.com",
      "tags": [
        "Easy Chicken Recipes",
        "Chicken",
        "Easy Recipes",
        "Poultry Recipes",
        "Easy Meat Dish Recipes",
        "Meat Dish Recipes",
        "Easy Lunch Recipes",
        "Lunch",
        "Roasted Chicken",
        "Roasting",
        "Asian",
        "Chinese Recipes",
        "Chicken Salad",
        "Salad Recipes",
        "Peanut Butter Fudge",
        "Asparagus",
        "Vegetable",
        "Apple",
        "Fruit",
        "Spring"
      ],
      "title": "Chinese Chicken Salad",
      "url": "http://www.foodnetwork.com/recipes/ina-garten/chinese-chicken-salad-recipe"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba674829e6",
      "category": "Meat",
      "image": "https://www.allrecipes.com/thmb/0nBQzHHB6ZT9OsdTS1peqys8M58=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/1018396-46d59e9fbd7143fea867301fc3614117.jpg",
      "directions": [
        "In a bowl, mash the yellow curry paste with about 2 tablespoons of chicken broth to help dissolve the paste; whisk in remaining chicken broth, sugar, curry powder, salt, light soy sauce, and coconut milk. Set aside.",
        "Heat a wok or large skillet over high heat for about 30 seconds; pour in the oil. Let the oil heat until shimmering, about 30 more seconds. Stir the chicken, garlic, and ginger into the hot oil; cook and stir until the chicken has begun to brown and the garlic and ginger are fragrant, about 2 minutes. Stir in the onion and potatoes, toss all ingredients in the hot oil, and pour in the sauce mixture. Bring the sauce to a boil, reduce heat, and cover the wok. Simmer until the chicken is cooked through and the potatoes are tender, 20 to 25 minutes."
      ],
      "ingredients": [
        "1 tablespoon yellow curry paste",
        "1/2 cup chicken broth, divided",
        "1 teaspoon white sugar",
        "1 1/2 teaspoons curry powder",
        "1/2 teaspoon salt",
        "4 1/2 teaspoons light soy sauce",
        "1 (5.6 ounce) can coconut milk",
        "1 tablespoon canola oil",
        "3 skinless, boneless chicken breast halves, sliced",
        "2 teaspoons minced garlic",
        "1 teaspoon minced fresh ginger",
        "1 onion, sliced",
        "2 potatoes - peeled, halved, and sliced"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Adriel's Chinese Curry Chicken",
      "url": "http://allrecipes.com/recipe/214774/adriels-chinese-curry-chicken/"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba67482ae6",
      "category": "Appetizer",
      "image": "https://natashaskitchen.com/wp-content/uploads/2020/10/Egg-Rolls-4.jpg",
      "directions": [
        "Heat 1 teaspoon vegetable oil in a wok or large skillet over medium heat. Pour in beaten eggs and cook, without stirring, until firmed. Flip the eggs over and cook for an additional 20 seconds to firm the other side. Set egg pancake aside to cool, then slice into thin strips.",
        "Heat the remaining vegetable oil in a wok or large skillet over high heat. Stir in cabbage and carrot; cook for 2 minutes to wilt. Add bamboo, mushroom, pork, green onions, soy sauce, salt, sugar, and MSG; continue cooking until the vegetables soften, about 6 minutes. Stir in sliced egg, then spread mixture out onto a pan, and refrigerate until cold, about 1 hour.",
        "To assemble the egg rolls, place a wrapper onto your work surface with one corner pointing towards you. Place about 3 tablespoons of cooled filling in a heap onto the bottom third of the wrapper. Brush a little beaten egg white onto the top two edges of the wrapper, then fold the bottom corner over the filling and roll firmly to the halfway point. Fold the left and right sides snugly over the egg roll, then continue rolling until the top corners seal the egg roll with the egg white. Repeat with remaining egg roll wrappers, covering finished egg rolls with plastic wrap to keep from drying out.",
        "Heat about 6-inches of oil in a wok or deep-fryer to 350 degrees F (175 degrees C).",
        "Fry egg rolls 3 or 4 at a time until golden brown, 5 to 7 minutes. Drain on paper towels."
      ],
      "ingredients": [
        "4 teaspoons vegetable oil",
        "3 eggs, beaten",
        "1 medium head cabbage, finely shredded",
        "1/2 carrot, julienned",
        "1 (8 ounce) can shredded bamboo shoots",
        "1 cup dried, shredded wood ear mushroom, rehydrated",
        "1 pound Chinese barbequed or roasted pork, cut into matchsticks",
        "2 green onions, thinly sliced",
        "2 1/2 teaspoons soy sauce",
        "1 teaspoon salt",
        "1 teaspoon sugar",
        "1/2 teaspoon monosodium glutamate (MSG)",
        "1 (14 ounce) package egg roll wrappers",
        "1 egg white, beaten",
        "4 cups oil for frying, or as needed"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Authentic Chinese Egg Rolls",
      "url": "http://allrecipes.com/recipe/61913/authentic-chinese-egg-rolls-from-a-c/"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba67482be6",
      "category": "Seafood",
      "image": "https://asianinspirations.com.au/wp-content/uploads/2018/07/R00705_ChineseSteamed-Fish.jpg",
      "directions": [
        "Fill a large pot 1/2 full with water and place a bamboo steamer with lid on top of the pot. Bring to a rolling boil. Scrub the scales off of the fish and rinse with cold water. Place the fish onto a small metal plate, belly side down.",
        "Place into the steamer and cover. Cook until the fish is no longer opaque and flakes easily, 10 to 12 minutes. Try not to take the lid off the pot until it is done steaming; this will ensure a fully-cooked and tender fish.",
        "While the fish is steaming, combine the vegetable oil, green onions, and ginger in a small saucepan. Cook over medium-high heat until the ginger bubbles. Carefully pour the hot oil over the steamed fish. Drizzle with soy sauce to serve."
      ],
      "ingredients": [
        "1 (4 pound) whole rockfish, dressed",
        "1/4 cup vegetable oil",
        "1 green onion, thinly sliced diagonally",
        "1 (1 inch) piece fresh ginger, peeled and cut into matchstick strips",
        "1/2 cup soy sauce"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Authentic Chinese Steamed Fish",
      "url": "http://allrecipes.com/recipe/159260/authentic-chinese-steamed-fish/"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba67482ce6",
      "category": "Vegetable",
      "image": "https://www.onceuponachef.com/images/2017/02/Asian-Vegetable-Stir-Fry-3-1700x1223.jpg",
      "directions": [
        "Bring the brown rice and water to a boil in a saucepan over high heat. Reduce the heat to medium-low, cover, and simmer until the rice is tender, and the liquid has been absorbed, 45 to 50 minutes.",
        "Heat the safflower oil in a skillet over medium heat. Stir in the leeks, garlic, and ginger; cook and stir until the leeks have softened, about 5 minutes. Stir in the zucchini, carrots, and yellow squash. Season with salt. Continue cooking and stirring until the vegetables have softened, about 2 minutes. Serve over brown rice."
      ],
      "ingredients": [
        "2 cups uncooked brown rice",
        "4 cups water",
        "1 tablespoon safflower oil",
        "1/3 cup leeks, chopped",
        "2 cloves garlic",
        "1 teaspoon minced fresh ginger root",
        "1 cup zucchini, chopped",
        "1 cup carrots, chopped",
        "1 cup yellow squash, chopped",
        "sea salt to taste"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Basic Chinese Stir Fry Vegetables",
      "url": "http://allrecipes.com/recipe/216739/basic-chinese-stir-fry-vegetables/"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba67482de6",
      "category": "Appetizer",
      "image": "https://www.allrecipes.com/thmb/NU3HSDfHJ67u-b27wAx7fXxXt7I=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/1107825-beefy-chinese-dumplings-Mainerisms-4x3-1-c53e96c05c394015ab21c495d09b9632.jpg",
      "directions": [
        "In a large bowl, mix together beef, cabbage, carrot, and onion. Stir in the egg, sugar, salt, soy sauce, and vegetable oil.",
        "Place a large teaspoonful of filling in the center of a dumpling skin. Moisten the edges of a wonton with a few drops of water. Then fold the dumpling in half, and pinch the edges together to seal. Create a ripple pattern along the pinched edge by pinching and gently pushing together small segments of it. Repeat with remaining dumplings.",
        "Boil the dumplings in water until they float to the top, about 5 minutes."
      ],
      "ingredients": [
        "1 1/2 pounds ground beef",
        "2 cups shredded Chinese cabbage",
        "1 carrot, shredded",
        "1 onion, minced",
        "1 egg",
        "1 teaspoon sugar",
        "1 teaspoon salt",
        "1 tablespoon soy sauce",
        "1 tablespoon vegetable oil",
        "1 (14 ounce) package wonton wrappers"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Beefy Chinese Dumplings",
      "url": "http://allrecipes.com/recipe/87535/beefy-chinese-dumplings/"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba67482ee6",
      "category": "Meat",
      "image": "https://eatlittlebird.com/wp-content/uploads/2019/01/char-siu-pork-22.jpg",
      "directions": [
        "Cut pork with the grain into strips 1 1/2- to 2-inches long; put into a large resealable plastic bag.",
        "Stir soy sauce, honey, ketchup, brown sugar, rice wine, hoisin sauce, red food coloring, and Chinese five-spice powder together in a saucepan over medium-low heat; cook and stir until just combined and slightly warm, 2 to 3 minutes. Pour the marinade into the bag with the pork, squeeze air from the bag, and seal. Turn bag a few times to coat all pork pieces in marinade.",
        "Marinate pork in refrigerator, 2 hours to overnight.",
        "Preheat an outdoor grill for medium-high heat and lightly oil the grate.",
        "Remove pork from marinade and shake to remove excess liquid. Discard remaining marinade.",
        "Cook pork on preheated grill for 20 minutes. Put a small container of water onto the grill and continue cooking, turning the pork regularly, until cooked through, about 1 hour. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C)."
      ],
      "ingredients": [
        "2 pork tenderloins",
        "1/2 cup soy sauce",
        "1/3 cup honey",
        "1/3 cup ketchup",
        "1/3 cup brown sugar",
        "1/4 cup Chinese rice wine",
        "2 tablespoons hoisin sauce",
        "2 tablespoons red food coloring",
        "1 teaspoon Chinese five-spice powder (optional)"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Char Siu (Chinese BBQ Pork)",
      "url": "http://allrecipes.com/recipe/232681/char-siu-chinese-bbq-pork/"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba67482fe6",
      "category": "Noodle",
      "image": "https://www.thecountrycook.net/wp-content/uploads/2023/02/1st-image-Chicken-Chow-Mein-Casserole-scaled.jpg",
      "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Prepare a casserole dish with cooking spray.",
        "Heat olive oil in a saucepan over medium heat; cook and stir onion in the hot oil until translucent, 5 to 7 minutes. Add soup and water; stir. Season the mixture with garlic salt and pepper.",
        "Layer chicken into the bottom of the prepared casserole dish; top with chow mein noodles and pimentos. Pour the mixture from the saucepan over the layers to cover.",
        "Bake in preheated oven until completely heated through, 20 to 30 minutes."
      ],
      "ingredients": [
        "cooking spray",
        "1 tablespoon olive oil",
        "1 small onion, diced",
        "1 (10.75 ounce) can low-fat cream of mushroom soup",
        "1 (10.75 ounce) can water",
        "1/4 teaspoon garlic salt, or to taste",
        "ground black pepper to taste",
        "1 roasted chicken, bones and skin removed, meat cut into cubes",
        "1 (8.5 ounce) package chow mein noodles",
        "1 (4 ounce) jar pimentos"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chicken and Chinese Noodles Casserole",
      "url": "http://allrecipes.com/recipe/234752/chicken-and-chinese-noodles-casserole/"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba674838e6",
      "category": "Vegetable",
      "image": "https://www.cookingclassy.com/wp-content/uploads/2019/12/chicken-stir-fry-1.jpg",
      "directions": [
        "Combine the chicken, oyster sauce, and soy sauce in a mixing bowl until the chicken is evenly coated with the sauce; set aside.",
        "Heat the vegetable oil in a wok or large skillet over high heat. Stir in the garlic and onion; cook and stir until the onion is limp, about 1 minute. Add the chicken and marinade. Cook and stir until the chicken has browned and is no longer pink, about 10 minutes.",
        "Pour in 1/2 cup of water; season with pepper and sugar. Add the water chestnuts, snow peas, and broccoli. Cover; boil until the vegetables are just tender, about 5 minutes. Dissolve the cornstarch in 1/4 cup of water. Stir into the boiling mixture; cook until thick and no longer cloudy."
      ],
      "ingredients": [
        "14 ounces skinless, boneless chicken breast meat - cut into bite-size pieces",
        "1/2 cup oyster sauce",
        "2 tablespoons soy sauce",
        "3 tablespoons vegetable oil",
        "2 cloves garlic, minced",
        "1 large onion, chopped",
        "1/2 cup water",
        "1 teaspoon ground black pepper",
        "1 teaspoon white sugar",
        "1 (8 ounce) can sliced water chestnuts, drained",
        "1 cup snow peas",
        "1 small head broccoli, cut into florets",
        "3 tablespoons cornstarch",
        "1/4 cup water"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chicken and Chinese Vegetable Stir-Fry",
      "url": "http://allrecipes.com/recipe/103218/chicken-and-chinese-vegetable-stir-fr/"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba674848e6",
      "category": "Desert",
      "image": "https://www.simplyrecipes.com/thmb/hDox3TKrhz3w3VQxcKYXHMsXM9k=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Chinese-Almond-Cookies-2-LEAD-8-4426e21977444f6eb018487481aae330.jpg",
      "directions": [
        "Sift flour, sugar, salt and baking powder together in a large bowl.  Using pastry blender or knives, cut in butter until mixture resembles coarse cornmeal.",
        "Beat the egg together with 2 tablespoons of the water and the almond extract.  Add this to the flour mixture and mix with a fork until dough leaves the sides of the bowl.",
        "On a lightly floured surface, knead the dough until it is smooth. Wrap it in foil or cling-wrap and refrigerate for one hour.",
        "Meanwhile, preheat oven to 350 degrees F (175 degrees C).",
        "Form dough into 1 inch balls and place them 3 inch apart on ungreased cookie sheets.  Flatten each cookie to about 1/4 inch thick and press an almond into the center of each.  Beat egg yolk with 1 tablespoon water and brush on cookies.",
        "Bake 20-25 minutes or until golden brown. Remove to wire rack to cool."
      ],
      "ingredients": [
        "2 1/2 cups sifted all-purpose flour",
        "3/4 cup white sugar",
        "1/4 teaspoon salt",
        "1 teaspoon baking powder",
        "3/4 cup butter, softened",
        "1 egg",
        "3 tablespoons water",
        "1 teaspoon almond extract",
        "36 blanched almonds",
        "1 egg yolk"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Almond Cakes",
      "url": "http://allrecipes.com/recipe/10693/chinese-almond-cakes/"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba674858e6",
      "category": "Meat",
      "image": "https://www.seriouseats.com/thmb/m-rJlDIWNDFJ9-9tCCfZTlUZgzk=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20090713-chinese-spare-ribs-3b8ebd24ec744b798713778074bd9e9b.jpg",
      "directions": [
        "In a large bowl, blend hoisin sauce, cranberry sauce, soy sauce, white wine, honey, and red food coloring. Mix in garlic salt and Chinese five-spice powder. Place ribs in the mixture. Cover, and marinate in the refrigerator at least 1 hour.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Place water in the bottom of a large roasting pan. Arrange ribs on pan rack, and cook 30 minutes in the preheated oven. Cover with remaining sauce mixture, and continue cooking 30 minutes, to an internal temperature of 160 degrees F (70 degrees C)."
      ],
      "ingredients": [
        "1/2 cup hoisin sauce",
        "1/4 cup jellied cranberry sauce",
        "3 tablespoons reduced sodium soy sauce",
        "2 tablespoons white wine",
        "2 tablespoons honey",
        "1/2 teaspoon red food coloring",
        "1/2 teaspoon garlic salt",
        "1/4 teaspoon Chinese five-spice powder",
        "4 pounds pork spareribs, cut into 1-inch pieces",
        "2 cups water"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Barbequed Spareribs",
      "url": "http://allrecipes.com/recipe/41206/chinese-barbequed-spareribs/"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba674868e6",
      "category": "Meat",
      "image": "https://images.squarespace-cdn.com/content/v1/52d3fafee4b03c7eaedee15f/dbfaa867-bdab-4b1e-9e84-fb966dab4a63/2023_06_01EOS+M505909-Edit.jpg?format=2500w",
      "directions": [
        "Bring a large pot of water to a boil, then add the spareribs, and cook uncovered for 3 to 5 minutes. Drain in a colander and set aside.",
        "Heat the vegetable oil in a skillet over high heat. Stir in the ginger, green onions, and cinnamon; cook and stir until fragrant. Stir in the spareribs and cook for 3 to 5 minutes. Pour in the water, soy sauce, sugar, and rice wine. Season with salt and pepper. Bring the mixture to a boil, then reduce heat to low and cover. Simmer until the spareribs are tender, about 1 hour."
      ],
      "ingredients": [
        "1 pound pork spareribs, cut into 3 inch pieces",
        "1 tablespoon vegetable oil",
        "1 (1 inch) piece fresh ginger root, sliced",
        "5 green onions cut into 2-inch pieces",
        "1/2 teaspoon ground cinnamon",
        "2 cups water",
        "1 1/2 tablespoons soy sauce",
        "1 teaspoon white sugar",
        "1 teaspoon rice wine",
        "1/4 teaspoon salt",
        "1/4 teaspoon pepper"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Braised Spare Ribs",
      "url": "http://allrecipes.com/recipe/64450/chinese-braised-spare-ribs/"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba674878e6",
      "category": "Vegetable",
      "image": "https://omnivorescookbook.com/wp-content/uploads/2023/08/230809_Chinese-Zucchini-Stir-Fry_1.jpg",
      "directions": [
        "Heat the sesame oil in a wok or large skillet over medium-high heat. Stir fry the onion and garlic in the hot oil until the onion begins to soften, about 2 minutes. Stir in the black bean sauce and chile peppers, and continue stir frying about 30 seconds to coat the onions with the black bean sauce.",
        "Stir in the zucchini, ginger, soy sauce, and water. Cover, reduce the heat to medium-low, and cook for 15 minutes until the zucchini is soft, stirring occasionally."
      ],
      "ingredients": [
        "2 tablespoons sesame oil",
        "1 small yellow onion, diced",
        "3 cloves garlic, minced",
        "1 tablespoon Chinese black bean sauce",
        "2 Thai chile peppers, seeded and chopped",
        "4 zucchinis, cut into 1/2-inch slices",
        "1 tablespoon minced fresh ginger root",
        "1 tablespoon soy sauce",
        "1/4 cup water"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Braised Zucchini",
      "url": "http://allrecipes.com/recipe/172391/chinese-braised-zucchini/"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba674888e6",
      "category": "Vegetable",
      "image": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/28/16/44/tzz8D5mNScad68XyfTrW.JPG",
      "directions": [
        "Preheat an oven to 350 degrees F (175 degrees C).",
        "Melt butter in a microwave-safe bowl in the microwave. Crush the ramen noodles into small pieces; stir the crushed noodles, almonds, and sesame seeds into the butter. Spread the mixture onto a baking sheet.",
        "Bake in the preheated oven until golden brown and crunchy, 8 to 10 minutes; allow to cool completely.",
        "Toss together the coleslaw mix and the green onion in a large bowl.",
        "Whisk together the salad oil, vinegar, sugar, soy sauce, and reserved seasoning packets in a separate bowl; stir the noodle mixture into the dressing. Pour the dressing over the coleslaw mix and toss to coat."
      ],
      "ingredients": [
        "1/4 cup butter",
        "2 (3 ounce) packages Oriental-flavor ramen noodle soup, seasoning packet reserved",
        "1/2 cup slivered almonds",
        "1/4 cup sesame seeds",
        "1 (16 ounce) package broccoli coleslaw mix",
        "1/2 cup chopped green onion",
        "1/2 cup salad oil",
        "1/4 cup apple cider vinegar",
        "1/2 cup white sugar",
        "2 tablespoons soy sauce"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Broccoli Slaw",
      "url": "http://allrecipes.com/recipe/187963/chinese-broccoli-slaw/"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba674898e6",
      "category": "Vegetable",
      "image": "https://www.allrecipes.com/thmb/usJBRWT5Ahx4lB7zOtXKvfg1Vew=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/AR-158854-Chinese-Buffet-Green-Beans-DDMFS-4x3-84906e64ca9f40d99c06d54ad4730eb9.jpg",
      "directions": [
        "Heat peanut oil in a wok or large skillet over medium-high heat. Stir in the garlic, and cook until the edges begin to brown, about 20 seconds. Add the green beans; cook and stir until the green beans begin to soften, about 5 minutes. Stir in the sugar, oyster sauce, and soy sauce. Continue cooking and stirring for several minutes until the beans have attained the desired degree of tenderness."
      ],
      "ingredients": [
        "1 tablespoon oil, peanut or sesame",
        "2 cloves garlic, thinly sliced",
        "1 pound fresh green beans, trimmed",
        "1 tablespoon white sugar",
        "2 tablespoons oyster sauce",
        "2 teaspoons soy sauce"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Buffet Green Beans",
      "url": "http://allrecipes.com/recipe/158854/chinese-buffet-green-beans/"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba6748a8e6",
      "category": "Salad",
      "image": "https://www.wellplated.com/wp-content/uploads/2020/04/Asian-Cabbage-Salad-Healthy.jpg",
      "directions": [
        "In a preheated 350 degree F oven (175 degree C), toast the crushed noodles and nuts until golden brown.",
        "In a large bowl, combine the coleslaw, green onions, toasted ramen noodles and cashews.",
        "To prepare the dressing, whisk together the sugar, oil, vinegar and soy sauce. Pour the dressing over the salad, toss and serve."
      ],
      "ingredients": [
        "1 (3 ounce) package ramen noodles, crushed",
        "10 ounces cashew pieces",
        "1 (16 ounce) package shredded coleslaw mix",
        "1 bunch green onions, chopped",
        "1/2 cup white sugar",
        "1/2 cup vegetable oil",
        "1/4 cup cider vinegar",
        "1 tablespoon soy sauce"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Cabbage Salad I",
      "url": "http://allrecipes.com/recipe/14285/chinese-cabbage-salad-i/"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba6748b8e6",
      "category": "Salad",
      "image": "https://kalynskitchen.com/wp-content/uploads/2016/09/2-1200-Asian-Cabbage-Salad-kalynskitchen.jpg",
      "directions": [
        "In a small saucepan, cook the vinegar and sugar over medium heat until dissolved. Remove from heat and stir in salt, pepper, ramen seasoning packet and oil. Set aside to cool.",
        "In a large bowl, combine the uncooked ramen noodles, broccoli coleslaw mix, and green onions. Pour dressing over salad; toss evenly to coat. Refrigerate until chilled.",
        "Sprinkle with almonds and sesame seeds before serving."
      ],
      "ingredients": [
        "3 tablespoons red wine vinegar",
        "2 tablespoons white sugar",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1 (3 ounce) package chicken flavored ramen noodles, crushed, seasoning packet reserved",
        "1/2 cup vegetable oil",
        "1 (16 ounce) package broccoli coleslaw mix",
        "1/2 cup chopped green onions",
        "4 ounces toasted slivered almonds",
        "1/4 cup sesame seeds, toasted"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Cabbage Salad II",
      "url": "http://allrecipes.com/recipe/14447/chinese-cabbage-salad-ii/"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba6748c8e6",
      "category": "Salad",
      "image": "https://www.allrecipes.com/thmb/-fWgup-iL9ESCUdlbzybEAkqPNE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3671208-napa-cabbage-salad-Mona-1x1-1-905218ad0d1f4d329a1eac07189388b7.jpg",
      "directions": [
        "In a small skillet, toast sesame seeds over medium heat until golden brown and fragrant.",
        "In a small bowl, mix together vinegar, sesame oil, olive oil, sugar, salt, pepper, and ramen seasoning packet.",
        "In a large bowl, mix together cabbage, carrots, and crushed ramen noodles. Toss with dressing to coat evenly.  Top with toasted sesame seeds."
      ],
      "ingredients": [
        "2 tablespoons sesame seeds",
        "1 1/2 tablespoons rice vinegar",
        "1/2 teaspoon sesame oil",
        "2 tablespoons white sugar",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1/3 cup olive oil",
        "4 cups shredded cabbage",
        "2 carrots, shredded",
        "1 (3 ounce) package ramen noodles, crushed"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Cabbage Salad",
      "url": "http://allrecipes.com/recipe/80526/chinese-cabbage-salad/"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba6748d8e6",
      "category": "Desert",
      "image": "https://www.cookiesbybess.com/wp-content/uploads/2018/01/IMG_3509-2-Feature-1.jpg",
      "directions": [
        "Mix butter, flour, and white sugar.   Spread in an 8 x 12 inch baking pan.",
        "Bake in pre-heated oven at 325 degrees F (165 degrees C) for 15 minutes.",
        "Beat eggs.  Add brown sugar, nuts and coconut.  Spread over baked crust.",
        "Bake for another 30 minutes.    When completely cool, dust with confectioners' sugar."
      ],
      "ingredients": [
        "1 cup butter, softened",
        "2 cups all-purpose flour",
        "4 tablespoons white sugar",
        "4  eggs",
        "1 ½ cups packed brown sugar",
        "1 cup chopped walnuts",
        "½ cup flaked coconut"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Chews II",
      "url": "http://allrecipes.com/recipe/10718/chinese-chews-ii/"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba6748f8e6",
      "category": "Soup",
      "image": "https://cravinghomecooked.com/wp-content/uploads/2018/04/chicken-potato-soup-1-8.jpg",
      "directions": [
        "In a large pot over high heat, combine the potatoes, carrot, turnip, onion, garlic, chicken and water to cover. Bring to a boil and reduce heat to low. Let soup simmer for 45 minutes to 1 hour. Skim fat, if desired, and season with salt and pepper to taste.",
        "Remove chicken leg from the soup and allow it cool. Remove the meat, returning it to the soup, and discard the skin and bones. Simmer for 30 to 45 more minutes, or longer, if desired."
      ],
      "ingredients": [
        "3 potatoes, cubed",
        "1 carrot, chopped",
        "1 turnip, chopped",
        "1 onion, chopped",
        "5 cloves garlic, minced",
        "1 chicken leg",
        "salt and pepper to taste"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Chicken and Potato Soup",
      "url": "http://allrecipes.com/recipe/16398/chinese-chicken-and-potato-soup/"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba6758d8e6",
      "category": "Meat",
      "image": "https://www.allrecipes.com/thmb/CyjBAN8P5fHH7a7g7EwZqh59jeE=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/1040059-afe82f85a0124fb0abd8a64d77052bac.jpg",
      "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "In a lightly greased 9x13 inch baking dish, combine the chicken, broth, soup, milk, almonds, mushroom pieces, water chestnuts, noodles, cheese and celery (if using). Mix well and make sure mixture is spread evenly in the dish.",
        "Bake in preheated oven for 45 minutes."
      ],
      "ingredients": [
        "2  skinless, boneless chicken breasts - cooked and cubed",
        "1 cup chicken broth",
        "1 (10.75 ounce) can condensed cream of mushroom soup",
        "1 (5 ounce) can evaporated milk",
        "1 cup sliced almonds",
        "1 (4.5 ounce) can sliced mushrooms, drained",
        "1 (8 ounce) can water chestnuts, drained and minced",
        "1 (5 ounce) can crispy chow mein noodles",
        "⅔ cup shredded Cheddar cheese",
        "1 cup diced celery (optional)"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Chicken Casserole Surprise",
      "url": "http://allrecipes.com/recipe/16850/chinese-chicken-casserole-surprise/"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba6768d8e6",
      "category": "Rice",
      "image": "https://www.allrecipes.com/thmb/yoCNlqpGo9T377kFdrLmaqHiNpI=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/16954-chineese-chicken-fried-rice-ii-ddmfs-3X4-0240-3db2550810b1464a965a89a55cc95c7a.jpg",
      "directions": [
        "Heat oil in a large skillet over medium heat. Add onion and saute until soft, then add chicken and 2 tablespoons soy sauce and stir-fry for 5 to 6 minutes.",
        "Stir in carrots, celery, red bell pepper, pea pods and green bell pepper and stir-fry another 5 minutes. Then add rice and stir thoroughly.",
        "Finally, stir in scrambled eggs and 1/3 cup soy sauce, heat through and serve hot."
      ],
      "ingredients": [
        "1/2 tablespoon sesame oil",
        "1 onion",
        "1 1/2 pounds cooked, cubed chicken meat",
        "2 tablespoons soy sauce",
        "2 large carrots, diced",
        "2 stalks celery, chopped",
        "1 large red bell pepper, diced",
        "3/4 cup fresh pea pods, halved",
        "1/2 large green bell pepper, diced",
        "6 cups cooked white rice",
        "2 eggs",
        "1/3 cup soy sauce"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Chicken Fried Rice I",
      "url": "http://allrecipes.com/recipe/17161/chinese-chicken-fried-rice-i/"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba6778d8e6",
      "category": "Rice",
      "image": "https://mojo.generalmills.com/api/public/content/iBO3Xc6cpkS4dYIpRqQl8Q_gmi_hi_res_jpeg.jpeg?v=effa94c0&t=22e69acac2fe412b8c0cbb786c67369c",
      "directions": [
        "In a small bowl, beat egg with water. Melt butter in a large skillet over medium low heat. Add egg and leave flat for 1 to 2 minutes. Remove from skillet and cut into shreds.",
        "Heat oil in same skillet; add onion and saute until soft. Then add rice, soy sauce, pepper and chicken. Stir fry together for about 5 minutes, then stir in egg. Serve hot."
      ],
      "ingredients": [
        "1 egg",
        "1 tablespoon water",
        "1 tablespoon butter",
        "1 tablespoon vegetable oil",
        "1 onion, chopped",
        "2 cups cooked white rice, cold",
        "2 tablespoons soy sauce",
        "1 teaspoon ground black pepper",
        "1 cup cooked, chopped chicken meat"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Chicken Fried Rice II",
      "url": "http://allrecipes.com/recipe/16954/chinese-chicken-fried-rice-ii/"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba6788d8e6",
      "category": "Salad",
      "image": "https://kikkomanusa.com/homecooks/wp-content/uploads/2021/10/13183_ChineseChickenRiceSalad.jpg",
      "directions": [
        "Place the rice and water in a saucepan and bring to a boil. Reduce heat to low, cover, and simmer until water is absorbed, about 45 minutes. Set aside to cool.",
        "To make the dressing, whisk together the oil, lemon juice, soy sauce, ginger, and teriyaki sauce in a small bowl. Season with salt and pepper.",
        "In a large bowl, mix together the cooked rice and chicken. Stir in celery, water chestnuts, mushrooms, green onion, and red pepper. Mix with the dressing to coat. Cover and refrigerate 8 hours or overnight. Toss gently before serving."
      ],
      "ingredients": [
        "1 cup brown rice",
        "2 1/2 cups water",
        "2 tablespoons olive oil",
        "3 tablespoons lemon juice",
        "3 tablespoons soy sauce",
        "1 teaspoon minced fresh ginger root",
        "1 teaspoon teriyaki sauce",
        "salt and black pepper to taste",
        "2 cups chopped, cooked chicken breast meat",
        "1 cup sliced celery",
        "1 cup sliced water chestnuts",
        "1 cup sliced fresh mushrooms",
        "1/2 cup diced green onion",
        "1/2 cup diced red bell pepper"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Chicken Rice Salad",
      "url": "http://allrecipes.com/recipe/35408/chinese-chicken-rice-salad/"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba6798d8e6",
      "category": "Salad",
      "image": "https://www.allrecipes.com/thmb/N4_A5g-MxGHVuZyLOcOp_bucSY0=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/4301819-7dffc161b6944a978fbc88b46341016c.jpg",
      "directions": [
        "In a small bowl whisk together the vinegar, stevia, soy sauce, hoisin sauce, salt, pepper, and pepper flakes until the salt dissolves.",
        "Whisk in the canola and sesame oils. Set the dressing aside.",
        "On a serving platter, arrange the napa cabbage in a bed.",
        "Arrange the chicken, then the orange sections on top of the cabbage.",
        "Pour the dressing over the salad.",
        "Sprinkle on the scallions, almonds, and sesame seeds, if using.",
        "Just before serving, toss to combine the layers."
      ],
      "ingredients": [
        "Dressing:",
        "2 tablespoons rice vinegar",
        "1 tablespoon Stevia In The Raw® Bakers Bag",
        "2 teaspoons reduced-sodium soy sauce",
        "1/2 teaspoon hoisin sauce",
        "1 teaspoon salt",
        "1/8 teaspoon ground black pepper",
        "1 pinch red pepper flakes",
        "4 teaspoons canola oil",
        "1 teaspoon toasted sesame oil",
        "Salad:",
        "6 cups napa cabbage, in 3/34-inch strips",
        "3 cups roasted chicken breast, in bit-size pieces",
        "1 (11 ounce) can mandarin orange sections, well drained",
        "1/2 cup chopped green onions, green and white parts",
        "1/3 cup sliced almonds, toasted",
        "4 teaspoons sesame seeds, for garnish (optional)"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Chicken Salad from Stevia In The Raw®",
      "url": "http://allrecipes.com/recipe/256465/chinese-chicken-salad-from-stevia-in/"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba67a8d8e6",
      "category": "Salad",
      "image": "https://www.eatyourselfskinny.com/wp-content/uploads/2021/01/chinese-chicken-salad-2-1-scaled.jpg",
      "directions": [
        "Pour sweet and sour sauce into a large bowl. Sprinkle ground ginger into the bowl and mix it thoroughly with the sauce.",
        "Place romaine lettuce and bean sprouts into the bowl of sauce and toss it a few times.",
        "Add the shredded chicken to the bowl and toss it thoroughly with the lettuce and bean sprouts.",
        "Transfer the salad into a large serving bowl or 4 separate serving bowls. Top with cornflakes, almonds and a pinch of black ground pepper. Sprinkle with sesame seeds, if desired."
      ],
      "ingredients": [
        "1 cup sweet and sour sauce",
        "1 pinch ground ginger",
        "6 cups romaine lettuce - torn, washed and dried",
        "1 cup fresh bean sprouts",
        "4 boneless chicken breast halves, cooked and shredded",
        "1/2 cup cornflakes cereal",
        "1/4 cup toasted sliced almonds",
        "1 pinch ground black pepper",
        "2 tablespoons sesame seeds (optional)"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Chicken Salad I",
      "url": "http://allrecipes.com/recipe/14167/chinese-chicken-salad-i/"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba67b8d8e6",
      "category": "Salad",
      "image": "https://www.recipetineats.com/wp-content/uploads/2015/06/Chinese-Chicken-Salad_0a.jpg",
      "directions": [
        "In a small bowl, whisk together the oil, vinegar, sugar, salt, pepper, and poppy seeds, and set aside.  Wash lettuce and tear into bite-sized pieces.  To a large bowl, first add the lettuce, then the onions, water chestnuts, and chicken.  Just before serving, top with the almonds, noodles and dressing, and toss lightly."
      ],
      "ingredients": [
        "1 head lettuce",
        "1 cup chopped cooked chicken breast",
        "1 (8 ounce) can chopped water chestnuts",
        "1 bunch green onions, chopped",
        "1 cup sliced almonds",
        "1 (5 ounce) can chow mein noodles",
        "1/2 cup vegetable oil",
        "4 tablespoons vinegar",
        "4 tablespoons white sugar",
        "1/2 teaspoon salt",
        "1 pinch ground black pepper",
        "1 tablespoon poppy seeds"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Chicken Salad II",
      "url": "http://allrecipes.com/recipe/18302/chinese-chicken-salad-ii/"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba67c8d8e6",
      "category": "Salad",
      "image": "https://www.allrecipes.com/thmb/fCCvUU540VorblMUD9995cC5ink=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/4005100-3ed1887ff4394c2490adadf4751b5a82.jpg",
      "directions": [
        "To prepare the dressing, whisk together the hoisin sauce, peanut butter, brown sugar, chili paste, ginger, vinegar, and sesame oil.",
        "Grill or broil the chicken breasts until cooked, about 10 minutes. An instant-read thermometer inserted into the center should read 165 degrees F (74 degrees C). Cool and slice.",
        "Preheat oven to 350 degrees F (175 C). Spray a large shallow pan with nonstick vegetable spray; arrange shredded wontons in a single layer and bake until golden brown, about 20 minutes. Cool.",
        "In a large bowl, combine the chicken, wontons, lettuce, carrots, green onions and cilantro. Toss with dressing and serve."
      ],
      "ingredients": [
        "3 tablespoons hoisin sauce",
        "2 tablespoons peanut butter",
        "2 teaspoons brown sugar",
        "3/4 teaspoon hot chile paste",
        "1 teaspoon grated fresh ginger",
        "3 tablespoons rice wine vinegar",
        "1 tablespoon sesame oil",
        "1 pound skinless, boneless chicken breast halves",
        "16 (3.5 inch square) wonton wrappers, shredded",
        "4 cups romaine lettuce - torn, washed and dried",
        "2 cups shredded carrots",
        "1 bunch green onions, chopped",
        "1/4 cup chopped fresh cilantro"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Chicken Salad III",
      "url": "http://allrecipes.com/recipe/14319/chinese-chicken-salad-iii/"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba67d8d8e6",
      "category": "Salad",
      "image": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/14/56/82/picbsqG9p.jpg",
      "directions": [
        "In a large salad bowl combine the chicken, lettuce, green onion, celery, nuts, seeds and noodles. Mix all together. Set aside.",
        "To Make Dressing: Put vinegar in a small bowl. Dissolve sugar and salt in vinegar before adding oil. Shake/Beat well.",
        "Add dressing to salad and toss to coat. Serve and enjoy!"
      ],
      "ingredients": [
        "3 1/2 boneless chicken breast halves, cooked and diced",
        "1 head lettuce, torn into small pieces",
        "4 green onions, sliced",
        "4 stalks celery, sliced thin",
        "1/2 cup walnuts, chopped",
        "2 tablespoons sesame seeds, toasted",
        "6 ounces Chinese noodles, heated briefly to crisp",
        "6 tablespoons seasoned rice vinegar",
        "4 tablespoons white sugar",
        "1 teaspoon salt",
        "1/2 cup peanut oil"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Chicken Salad",
      "url": "http://allrecipes.com/recipe/8914/chinese-chicken-salad/"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba67e8d8e6",
      "category": "Soup",
      "image": "https://thewoksoflife.com/wp-content/uploads/2023/05/Chinese-chicken-noodle-soup-13.jpg",
      "directions": [
        "In a large pot, heat oil over medium heat.  Cook turmeric, ginger and chile paste in oil until fragrant, 1 to 2 minutes.  Stir in chicken, broth, sugar, soy sauce and celery.  Bring to a boil, then introduce noodles and cook 3 minutes.  Stir in lettuce and remove from heat.  Serve garnished with green onions."
      ],
      "ingredients": [
        "2 tablespoons sesame oil",
        "1/2 teaspoon ground turmeric",
        "2 teaspoons chopped fresh ginger root",
        "2 tablespoons chile paste",
        "1 pound chopped cooked chicken breast",
        "1 quart chicken broth",
        "2 teaspoons sugar",
        "1/4 cup soy sauce",
        "1 cup chopped celery",
        "1 (3 ounce) package ramen noodles",
        "1 cup shredded lettuce",
        "1/2 cup chopped green onion"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Chicken Soup",
      "url": "http://allrecipes.com/recipe/23878/chinese-chicken-soup/"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f7ba67f8d8e6",
      "category": "Soup",
      "image": "https://www.allrecipes.com/thmb/VCGKYj9HkUd0d96GrlPxuRhs-So=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/910582-7eb8d89a61ca48a5af99ec13a448a00d.jpg",
      "directions": [
        "Heat the vegetable oil in a large Dutch oven or soup pot over medium-high heat, and cook and stir the chicken thigh and breast meat until the chicken is no longer pink inside, about 3 minutes. When the chicken is cooked, stir in the water, chicken bouillon cube, garlic, ginger, soy sauce, and sesame oil. Bring the soup to a boil, and reduce heat to a simmer.",
        "Stir in the baby corn, water chestnuts, carrots, broccoli florets, napa cabbage, red bell pepper, green onions, celery, zucchini, and snow peas, and simmer until the carrots start to softened, and the broccoli and snow peas turn bright green, 1 to 2 minutes. Mix in the mushrooms, and simmer for 5 more minutes."
      ],
      "ingredients": [
        "1 teaspoon vegetable oil",
        "1 pound boneless chicken thighs - cut into bite-size pieces",
        "1 skinless, boneless chicken breast half - cut into bite-size pieces",
        "8 cups water",
        "1 chicken bouillon cube",
        "1 clove garlic, minced",
        "1 teaspoon minced fresh ginger root",
        "2 teaspoons soy sauce",
        "1/2 teaspoon Asian (toasted) sesame oil",
        "1 (7 ounce) can baby corn ears",
        "1 (8 ounce) can sliced water chestnuts, rinsed and drained",
        "1 (10 ounce) bag shredded carrots",
        "1 cup broccoli florets",
        "1 cup shredded napa cabbage",
        "1/2 red bell pepper, chopped",
        "5 green onions, chopped",
        "1 stalk celery, thinly sliced",
        "1 small zucchini, thinly sliced",
        "1 cup snow peas",
        "1 cup sliced fresh mushrooms"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Chicken Vegetable Soup",
      "url": "http://allrecipes.com/recipe/218971/chinese-chicken-vegetable-soup/"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f8ba6758d8e6",
      "category": "Meat",
      "image": "https://www.allrecipes.com/thmb/_fc8NNmqGCg5c2bHVxDnZJMYzDM=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/903661-a2187c57b7634f46a8c15a9367503e85.jpg",
      "directions": [
        "Whisk together the soy sauce, lemon juice, onion powder, garlic powder, bay leaves, and orange juice in a large glass or ceramic bowl. Add the chicken wings and toss to evenly coat. Cover the bowl with plastic wrap, and marinate in the refrigerator for 8 hours to 2 days.",
        "Preheat an oven to 350 degrees F (175 degrees C).",
        "Bake the chicken wings in the preheated oven until no longer pink at the bone and the juices run clear, 45 to 55 minutes, basting every 10 minutes. For crispier skin, drain the juices from the pan during the last 10 minutes of baking."
      ],
      "ingredients": [
        "1 (16 ounce) bottle soy sauce",
        "3 tablespoons lemon juice",
        "1 1/2 tablespoons onion powder",
        "1 1/2 teaspoons garlic powder",
        "2 bay leaves, crushed",
        "1 cup orange juice",
        "5 pounds chicken wings, cut into thirds, tips discarded"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Chicken Wings",
      "url": "http://allrecipes.com/recipe/204245/chinese-chicken-wings/"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-f9ba6758d8e6",
      "category": "Vegetables",
      "image": "https://static01.nyt.com/images/2014/02/05/dining/05PAIR_SPAN/05PAIR_SPAN-articleLarge.jpg?width=1280&quality=75&auto=webp",
      "directions": [
        "Heat vegetable oil over medium heat in a large soup pot, and brown the pork and beef, stirring often, about 10 minutes. Mix in the green bell peppers, onions, and celery. Cook until the vegetables have given up their juice; cover and simmer until the vegetables are tender, about 20 minutes. Stir in beef broth, bamboo shoots, water chestnuts, black pepper, and chili powder.",
        "Mix the soy sauce and cornstarch in a bowl until smooth, and pour it into the soup. Stir until the soup thickens, about 1 minute; cover the chili, and reduce heat to a simmer. Simmer until the meat is very tender and the flavors have blended, about 2 hours; about 5 minutes before serving, stir in the mushrooms and bean sprouts."
      ],
      "ingredients": [
        "1 teaspoon vegetable oil",
        "2 pounds pork shoulder, cubed",
        "1 pound boneless beef round steak, cubed",
        "2 large green bell peppers, chopped",
        "2 large onions, chopped",
        "2 small stalks celery, diced",
        "4 cups beef broth",
        "1 (8 ounce) can sliced bamboo shoots, drained",
        "1 (8 ounce) can sliced water chestnuts, drained",
        "1 teaspoon ground black pepper",
        "2 tablespoons chili powder, or to taste",
        "1/2 cup soy sauce",
        "3 tablespoons cornstarch",
        "8 sliced fresh mushrooms",
        "1 cup fresh bean sprouts"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Chili",
      "url": "http://allrecipes.com/recipe/218132/chinese-chili/"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-faba6758d8e6",
      "category": "Desert",
      "image": "https://www.allrecipes.com/thmb/RRhQ84H6ezH7_2rswWVGbAccaM0=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/872263-68a02bfdff3b47d3b65f283ecfbf65e1.jpg",
      "directions": [
        "Melt chocolate and peanut butter chips in the top of a double boiler over simmering water, stirring frequently, until smooth.",
        "Mix chow mein noodles and peanuts in a large mixing bowl. Pour chocolate mixture over noodles and peanuts and turn to coat.",
        "Line a baking sheet with waxed paper. Drop mixture by rounded tablespoonfuls onto prepared sheet. Refrigerate until set, about 2 hours."
      ],
      "ingredients": [
        "1 cup semisweet chocolate chips",
        "1 cup peanut butter chips",
        "1 cup chow mein noodles",
        "1 cup dry-roasted peanuts"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Christmas Cookies",
      "url": "http://allrecipes.com/recipe/228302/chinese-christmas-cookies/"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-fbba6758d8e6",
      "category": "Rice",
      "image": "https://omnivorescookbook.com/wp-content/uploads/2015/03/1502_Clay-Pot-Chicken-Rice_003-1.jpg",
      "directions": [
        "Combine the chicken breast, the chicken wings, 1 cup dark soy sauce, the sesame oil, and the garlic in a mixing bowl; season with white pepper. Slice the Chinese sausages on an angle and add to the chicken mixture. Mix well, cover, and chill at least 10 minutes.",
        "Thoroughly rinse the shiitake mushrooms and place in a bowl; pour  hot water over the mushrooms; allow the mushrooms to sit submerged until they are soaked and bloated, about 15 minutes. Remove the mushrooms, reserving the liquid. Cut the stalks from the mushrooms and discard. Slice the mushrooms in half and set aside.",
        "Heat the oil in a large, deep skillet over medium heat. Cook the chicken pieces in the hot oil until no longer pink in the center and the juices run clear, 7 to 10 minutes. Drizzle 1/2 cup dark soy sauce over the chicken.",
        "Wash the rice with water until the water comes out nearly clear; drain completely. Combine the rice and 1 1/2 cup of the reserved liquid from the mushrooms in a non-stick pan; bring to a boil. Reduce heat to low; cover and allow to simmer covered for 10 minutes with the heat on. Add the chicken mixture and mushrooms and remove from the heat; allow to sit covered until the rice is completely tender, 15 to 20 minutes.",
        "Stir together the chile paste, ginger, and lime juice in a small bowl; drizzle over the chicken rice and top with shredded lettuce to serve."
      ],
      "ingredients": [
        "1 whole chicken breast, cut into big chunks",
        "6 chicken wings, cut into thirds, tips discarded",
        "1 cup dark soy sauce",
        "1 tablespoon sesame oil",
        "8 cloves garlic, smashed",
        "ground white pepper to taste",
        "2 links lop chong (Chinese-style sausage)",
        "6 dried shiitake mushrooms",
        "2 tablespoons vegetable oil",
        "1/2 cup dark soy sauce",
        "1 2/3 cups jasmine rice",
        "5 tablespoons chile paste",
        "2 tablespoons grated fresh ginger root",
        "2 tablespoons fresh lime juice",
        "1 cup shredded iceberg lettuce"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Clay Pot Chicken Rice",
      "url": "http://allrecipes.com/recipe/57978/chinese-clay-pot-chicken-rice/"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-fdba6758d8e6",
      "category": "Rice",
      "image": "https://twoplaidaprons.com/wp-content/uploads/2022/11/clay-pot-rice-top-down.jpg",
      "directions": [
        "Heat the vegetable oil in a large saucepan with a lid over medium heat. Cook and stir the bacon pieces until lightly browned and the oil has a bacon flavor, about 1 minute. Remove the bacon from the pan, turn the heat to high, stir in the garlic, and cook until the garlic cloves are beginning to turn golden brown, about 1 more minute. Add the chicken pieces, stirring to seal the surfaces of the meat. Turn the heat down, and cook until golden brown on the outside but still pink on the inside, about 3 minutes.",
        "Return the bacon pieces to the pan, and stir in the dark soy sauce, oyster sauce, light soy sauce, and rice, and mix everything together until well-combined. Pour in the water (should not reach to the top of the rice mixture), cover the pan, and turn the heat to low. Simmer until the rice is cooked and grains of roasted rice are stuck on the bottom of the pan, about 30 minutes. Serve each portion topped with some of the browned rice kernels scraped from the bottom."
      ],
      "ingredients": [
        "1 tablespoon vegetable oil",
        "2 thick slices back bacon or Canadian bacon, cut into bite-size pieces",
        "5 cloves garlic, peeled and smashed",
        "3 large chicken legs -- boned, skinned, and cut into large chunks",
        "1/2 cup dark soy sauce, or to taste",
        "2 tablespoons oyster sauce",
        "1 1/2 tablespoons light-colored soy sauce",
        "2 cups uncooked white rice",
        "1/2 cup water"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Clay Pot Rice with Chicken",
      "url": "http://allrecipes.com/recipe/126226/chinese-clay-pot-rice-with-chicken/"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-feba6758d8e6",
      "category": "Breakfast",
      "image": "https://thewoksoflife.com/wp-content/uploads/2015/06/coconut-buns-10.jpg",
      "directions": [
        "Place 1/3 cup sugar and milk in a small saucepan, and stir until the sugar is dissolved. Add 1/4 cup softened butter, and gently warm the mixture until the butter melts and the mixture is warm but not hot (no warmer than about 100 degrees F (40 degrees C). In a large bowl, stir together the yeast with 2 1/2 cups flour until well blended, and pour the milk mixture into the flour-yeast mixture. Stir in 1 beaten egg, and mix until the mixture forms a sticky, wet dough.",
        "Turn the dough out onto a well-floured surface, and knead for about 10 minutes, gradually kneading in 1 cup of additional flour or as needed to make a smooth, elastic dough. Form the dough into a round ball, place into an oiled bowl, and turn the dough around in the bowl a few times to coat with oil. Cover the bowl with a cloth, and allow dough to rise in a warm place until doubled, about 1 hour.",
        "Cream 1/4 cup softened butter with 1/2 cup of sugar in a bowl until the mixture is light and fluffy, and stir in dry milk powder, 1/2 cup flour, and the coconut until the mixture is smooth and well blended. Set the filling aside.",
        "Working on a floured surface, punch down the dough, and cut into 2 equal pieces. Cut each piece into 8 equal-sized pieces (16 pieces total). Form each piece into an oblong bun, and flatten the bun with a floured rolling pin. Scoop up about 1 tablespoon of filling with a spoon, and place in the center of a bun. Pull and pinch the edges of the dough together to enclose the filling in the bun. Repeat with all dough pieces, and place the filled buns, seam sides down, onto the prepared baking sheets. Cover the buns with a cloth, and allow to rise in a warm place 1 hour.",
        "Preheat an oven to 375 degrees F (190 degrees C). Line baking sheets with parchment paper.",
        "For a glossy coating, beat 1 egg in a bowl, and brush each bun with a little beaten egg. Sprinkle each bun with a few sesame seeds.",
        "Bake in the preheated oven until the buns are golden brown, 10 to 15 minutes. Allow to cool before serving."
      ],
      "ingredients": [
        "⅓ cup white sugar",
        "1 cup milk",
        "¼ cup softened butter",
        "1 tablespoon active dry yeast",
        "2 ½ cups all-purpose flour",
        "1  egg, beaten",
        "1 cup all-purpose flour, or more if needed",
        "¼ cup softened butter",
        "½ cup white sugar",
        "½ cup nonfat dry milk powder",
        "½ cup all-purpose flour",
        "1 cup finely grated fresh coconut",
        "1  egg (optional)",
        "1 tablespoon sesame seeds, for garnish (optional)"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Cocktail Buns",
      "url": "http://allrecipes.com/recipe/213476/chinese-cocktail-buns/"
    },
    {
      "id": "bf53a988-c81e-46d4-846b-ffba6758d8e6",
      "category": "Desert",
      "image": "https://www.nomss.com/wp-content/uploads/2022/09/CHINESE-COCONUT-MILK-PUDDING-DESSERT-NOMSS-1200-12.jpg",
      "directions": [
        "Lightly grease a 1-quart mold.",
        "In a large bowl, dissolve gelatin in boiling water.  Stir in evaporated milk, sugar and coconut extract.  Allow to cool to room temperature.",
        "Meanwhile, whip egg whites until fluffy.  When gelatin mixture has cooled to room temperature, place gelatin bowl in an ice bath.  When mixture begins to set, fold egg whites into it.  Spread in prepared mold and refrigerate until set."
      ],
      "ingredients": [
        "2 tablespoons unflavored gelatin",
        "1 3/8 cups boiling water",
        "1 (5 ounce) can evaporated milk",
        "1 cup white sugar",
        "1 teaspoon coconut extract",
        "2 egg whites"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Coconut Pudding",
      "url": "http://allrecipes.com/recipe/27126/chinese-coconut-pudding/"
    },
    {
      "id": "bf53a988-c81e-46d4-846c-feba6758d8e6",
      "category": "Salad",
      "image": "https://theforkedspoon.com/wp-content/uploads/2019/08/Chinese-Chicken-Pasta-Salad-6.jpg",
      "directions": [
        "Cook pasta in a large pot of boiling water until al dente.  Rinse and drain.  Set aside.",
        "In a large bowl, combine peanut butter, broth, soy sauce, garlic, and crushed red pepper.  Mix well.  Add pasta, sliced red pepper, scallions, and cilantro; toss to combine.  Chill."
      ],
      "ingredients": [
        "8 ounces dry fettuccine pasta",
        "2 tablespoons natural peanut butter",
        "1/2 cup vegetable broth",
        "2 tablespoons soy sauce",
        "3 cloves garlic, minced",
        "2 teaspoons crushed red pepper flakes",
        "1 red bell pepper, chopped",
        "2 green onions, chopped",
        "1/2 cup chopped fresh cilantro"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Cold Pasta Salad",
      "url": "http://allrecipes.com/recipe/13953/chinese-cold-pasta-salad/"
    },
    {
      "id": "bf53a988-c81e-46d4-846d-feba6758d8e6",
      "category": "Soup",
      "image": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/16/87/45/pic2LNgYe.jpg",
      "directions": [
        "Heat the chicken broth in a saucepan over medium heat, and stir in the can of corn. Let the mixture heat to a boil, stirring occasionally, and reduce heat to a simmer.",
        "In a skillet over medium-low heat, melt the butter and cook and stir the celery and onion until tender, about 5 minutes. Stir in the flour, and cook and stir for about 2 minutes to remove the raw taste from the flour. Add the vegetable mixture to the saucepan, whisking in the flour to avoid lumps, and stir in the nutmeg. Let the soup return to a simmer.",
        "Whisk the egg in a bowl until thoroughly beaten. Stir the soup slowly in a clockwise circular motion, and slowly pour the egg into the moving soup. Stir the egg lightly through the soup with a fork to produce egg strands, and sprinkle with black pepper to serve."
      ],
      "ingredients": [
        "5 cups chicken broth",
        "1 (14.75 ounce) can cream-style corn",
        "1/4 cup butter",
        "1 stalk celery, cut into bite-size pieces",
        "1 onion, cut into bite-size pieces",
        "1 1/2 tablespoons all-purpose flour",
        "1 teaspoon ground nutmeg, or to taste",
        "1 egg, or more as desired",
        "fresh ground pepper (optional)"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Corn Soup",
      "url": "http://allrecipes.com/recipe/180673/chinese-corn-soup/"
    },
    {
      "id": "bf53a988-c81e-46d4-846e-feba6758d8e6",
      "category": "Soup",
      "image": "https://res.cloudinary.com/orthodox-union/image/fetch/c_fill,w_250,f_auto,q_auto/https://oukosher.org/content/uploads/2006/09/Chinese-Creamed-Corn-Soup-chicken-e1467810786537.jpg",
      "directions": [
        "Mince chicken.  Mix together with sherry, salt, and egg whites in a large mixing bowl.  Add cream style corn, and mix well to blend.",
        "Preheat a wok or large frying pan to medium high.  Add chicken broth and soy sauce, and bring to a boil.  Add chicken mixture, and return to boil.  Reduce heat.  Simmer for 3 minutes, stirring frequently to prevent burning.",
        "In a cup, mix together water and cornstarch until well blended.  Add cornstarch mixture to simmering soup, stirring constantly.  Cook for an additional 2 minutes; soup will thicken slightly.  Crumble cooked bacon over individual servings."
      ],
      "ingredients": [
        "½ pound skinless, boneless chicken breast meat - finely chopped",
        "1 tablespoon sherry",
        "¼ teaspoon salt",
        "2  egg whites",
        "1 (14.75 ounce) can cream-style corn",
        "4 cups chicken broth",
        "2 teaspoons soy sauce",
        "¼ cup water",
        "2 tablespoons cornstarch",
        "4 slices crisp cooked bacon, crumbled"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Creamy Corn Soup",
      "url": "http://allrecipes.com/recipe/13193/chinese-creamy-corn-soup/"
    },
    {
      "id": "bf53a988-c81e-46d4-846f-feba6758d8e6",
      "category": "Meat",
      "image": "https://www.allrecipes.com/thmb/abp_G73oAv1-8y4xrWEfHlXF7wU=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/102166-52fdabaa9bc3440d973fb677bace9ccf.jpg",
      "directions": [
        "Fry the slice of bacon in a skillet over medium-high heat. Set aside. Reduce the heat to medium. Pour the egg into the skillet, and sprinkle with corn. Cook for less than 10 seconds.",
        "Lay the tortilla over the whole egg. After the egg is firm and attached to the tortilla, flip over, and lay the bacon on top. Put salsa over the bacon, and wrap. Remove from the skillet, cut into small pieces and serve hot."
      ],
      "ingredients": [
        "1 slice bacon",
        "1 egg, beaten",
        "1 (6 inch) corn tortilla",
        "1/4 cup sweet corn kernels",
        "1 tablespoon smooth salsa"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Dan-Bin",
      "url": "http://allrecipes.com/recipe/75579/chinese-dan-bin/"
    },
    {
      "id": "bf53a988-c81e-46d4-847e-feba6758d8e6",
      "category": "Breakfast",
      "image": "https://www.allrecipes.com/thmb/_iVGFn_S6_TKZAr3hClFJOMjEWk=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/1060634-a7c9618b03344534acfed4426c9cbc2d.jpg",
      "directions": [
        "Mix pork, dandelion greens, napa cabbage, bok choy, 4 minced green onions, 1 tablespoon of ginger, 3 cloves of garlic, bamboo shoots, 3 tablespoons of soy sauce, white pepper, salt, 1 teaspoon of sugar, and 4 teaspoons of sesame oil. Chill in the refrigerator 6 to 8 hours, or overnight.",
        "Beat the egg white with the water in a small bowl and set aside. Place 1 tablespoon of the pork mixture into a wonton wrapper, working one at at time. Cover additional wrappers with a moist towel to prevent drying. Brush the edges of the wrapper with the egg white mixture. Fold the wrapper and seal the edges with a moistened fork.",
        "Spray a large skillet with cooking spray. Heat 2 tablespoons for vegetable oil over medium-high heat. Working in batches, place the dumplings into the skillet, seam side up. Cook until the dumplings brown slightly, 30 seconds to 1 minute. Pour 1/2 cup of water into the skillet and cover. Gently steam the dumplings until the oil and water begin to sizzle, 7 to 8 minutes. Once the water is cooked off, flip the dumplings and continue cooking until the bottom begin to brown, 3 to 5 minutes. Repeat in batches with the remaining dumplings, oil, and water. Serve with dipping sauce.",
        "To make dipping sauce: Combine chili oil, hoisin sauce, 1/2 cup of soy sauce, 4 teaspoons of sesame oil, 1 teaspoon of sugar, balsamic vinegar, 1 teaspoon of ginger, 2 tablespoons of green onion, and 2 cloves of garlic in a bowl."
      ],
      "ingredients": [
        "2 pounds ground pork",
        "2 cups minced dandelion greens",
        "3 cups minced napa cabbage",
        "1/2 cup minced bok choy leaves",
        "4 green onions, white and light green parts only, minced",
        "1 tablespoon minced fresh ginger root",
        "3 cloves garlic, minced",
        "1 (8 ounce) can bamboo shoots, drained and minced",
        "3 tablespoons soy sauce",
        "1 teaspoon white pepper",
        "1 teaspoon kosher salt",
        "1 teaspoon white sugar",
        "4 teaspoons sesame oil",
        "1 egg whites",
        "1 tablespoon water",
        "100 wonton wrappers",
        "1/2 cup vegetable oil",
        "2 teaspoons chili oil, or to taste",
        "3 tablespoons hoisin sauce",
        "1/2 cup soy sauce",
        "4 teaspoons sesame oil",
        "1 teaspoon white sugar",
        "3 tablespoons balsamic vinegar",
        "1 teaspoon minced fresh ginger root",
        "2 tablespoons chopped green onion",
        "2 cloves garlic, minced"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Dandelion Dumplings",
      "url": "http://allrecipes.com/recipe/197938/chinese-dandelion-dumplings/"
    },
    {
      "id": "bf53a988-c81e-46d4-848e-feba6758d8e6",
      "category": "Meat",
      "image": "https://whattocooktoday.com/wp-content/uploads/2012/06/DSC_7747.jpg",
      "directions": [
        "Place chicken in a stockpot with water to cover; bring to a boil and cook until juices run clear, at least 20 minutes. An instant-read thermometer inserted into the thickest part of the thigh near the bone should read 165 degrees F (74 degrees C). Remove chicken; set aside to cool. Reserve 1/2 cup of the cooking liquid.",
        "Remove chicken meat from bone; cut meat into 1/2-inch by 2-inch strips. Mix cornstarch and cold water together in a small bowl. Toss meat in 1/2 of the cornstarch mixture.",
        "Heat peanut oil in a wok or large skillet over high heat. Add chicken mixture, ginger, and chiles; cook and stir until fragrant, 2 to 3 minutes. Add reserved cooking liquid, vinegar, rice wine, peppercorns, and salt. Return to boil; cook and stir until mixture is almost dry, about 3 minutes. Stir in spring onions, monosodium glutamate, and remaining cornstarch mixture; cook until sauce is thickened, 2 to 3 minutes more. Drizzle with sesame oil."
      ],
      "ingredients": [
        "1 (2 pound) whole chicken",
        "1 tablespoon cornstarch",
        "1 tablespoon cold water",
        "6 tablespoons peanut oil",
        "1 1/2 tablespoons grated fresh ginger",
        "2 teaspoons finely chopped dried chile peppers",
        "3 tablespoons vinegar",
        "1 1/2 tablespoons rice wine",
        "20 Szechuan peppercorns, crushed",
        "salt to taste",
        "2 spring onions, chopped, or more to taste",
        "1/8 teaspoon monosodium glutamate (MSG)",
        "2 teaspoons sesame oil"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Dong'an Chicken",
      "url": "http://allrecipes.com/recipe/246186/chinese-dongan-chicken/"
    },
    {
      "id": "bf53a988-c81e-46d4-849e-feba6758d8e6",
      "category": "Breakfast",
      "image": "https://i0.wp.com/blog.themalamarket.com/wp-content/uploads/2022/05/danjiao-4.jpeg?w=1200&ssl=1",
      "directions": [
        "Whisk together the eggs, 2 teaspoons of cornstarch, water, and 1/4 teaspoon of salt in a bowl, and let stand for 25 minutes.",
        "Mix the pork, water chestnuts, green onions, 1 teaspoon cornstarch, ginger, 1/2 teaspoon sugar, 1/2 teaspoon salt, and toasted sesame oil in a bowl, kneading the mixture till well-combined. Cover the bowl with plastic wrap, and let rest in refrigerator until needed.",
        "To make wrappers, spray a nonstick skillet with cooking spray and heat over medium heat. Slowly pour about 1 tablespoon of the egg mixture into the skillet, and tilt the skillet to spread the batter, forming a flat circle about 3 inches in diameter. Let the egg wrapper cook until firm on the bottom but still moist on top, about 1 minute. Stack the finished egg wrappers on a wax-paper-lined plate as you finish them, and let cool.",
        "Stir together the chicken broth, soy sauce, sherry, 1/4 teaspoon salt, 1/2 teaspoon sugar, and black pepper in a saucepan, and heat to a simmer over medium-low heat.",
        "Place about 1 teaspoon of the pork filling into the center of each wrapper, fold the wrapper over to make a half-moon shape, and gently press the wrapper together to seal. Drop the filled dumplings into the seasoned chicken broth and simmer them until the filling is cooked through, 10 to 15 minutes. Serve with broth."
      ],
      "ingredients": [
        "4 eggs",
        "2 teaspoons cornstarch",
        "1 teaspoon water",
        "1/4 teaspoon salt",
        "3 ounces ground pork",
        "3 water chestnuts, minced",
        "1 1/2 teaspoons finely chopped green onions",
        "1 teaspoon cornstarch",
        "1/2 teaspoon finely shredded fresh ginger",
        "1/2 teaspoon white sugar",
        "1/2 teaspoon salt",
        "1/4 teaspoon toasted sesame oil",
        "3/4 cup chicken broth",
        "1 tablespoon soy sauce",
        "1/2 teaspoon dry sherry",
        "1/4 teaspoon salt",
        "1/2 teaspoon white sugar",
        "1/4 teaspoon black pepper"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Egg Dumplings",
      "url": "http://allrecipes.com/recipe/82204/chinese-egg-dumplings/"
    },
    {
      "id": "bf53a988-c81e-46d4-84ae-feba6758d8e6",
      "category": "Soup",
      "image": "https://www.gimmesomeoven.com/wp-content/uploads/2019/02/Eggdrop-Soup-7-1.jpg",
      "directions": [
        "Bring chicken broth and peas to a boil in a large saucepan.",
        "Slowly add egg to the boiling broth, stirring constantly.  Serve hot, garnished with chopped green onions."
      ],
      "ingredients": [
        "4 cups seasoned chicken broth",
        "1/2 cup frozen green peas",
        "1 egg, beaten"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Egg Soup",
      "url": "http://allrecipes.com/recipe/12920/chinese-egg-soup/"
    },
    {
      "id": "bf53a988-c81e-46d4-84be-feba6758d8e6",
      "category": "Vegetable",
      "image": "https://www.theendlessmeal.com/wp-content/uploads/2017/02/eggplant-fries-16.jpg",
      "directions": [
        "In a shallow bowl, stir together the flour, cornmeal, cayenne pepper, salt, and black pepper. Place the eggs in a separate bowl.",
        "Heat the oil in a large skillet over medium heat. A few at a time, dip the eggplant pieces into the egg, then into the flour mixture, then back into the egg, and back into the flour mixture. Fry the eggplant in the hot oil until golden brown. Drain on paper towels, and serve immediately."
      ],
      "ingredients": [
        "2 cups all-purpose flour",
        "1 cup cornmeal",
        "1 pinch cayenne pepper, or to taste",
        "salt and pepper to taste",
        "2 eggs, beaten",
        "3 tablespoons vegetable oil",
        "2 eggplants, peeled and sliced into fries"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Eggplant Fries",
      "url": "http://allrecipes.com/recipe/50875/chinese-eggplant-fries/"
    },
    {
      "id": "bf53a988-c81e-46d4-84ce-feba6758d8e6",
      "category": "Drink",
      "image": "https://lh5.ggpht.com/02SBoWrqrbqtavBiRa-P63y5-wrl4LYEIcO8Emvvt5xzIcJuxgYOeNvaCs6JutuMxE-jWReOc0F9GQGh5ggzGg=w1280-h1280-c-rw-v1-e365",
      "directions": [
        "Pour the grenadine and lime juice into a tall glass. Pour in the cola to mix. Float a strip of lemon zest on top to garnish."
      ],
      "ingredients": [
        "1 tablespoon cherry grenadine syrup",
        "1 tablespoon lime juice",
        "1 (12 fluid ounce) can or bottle cola soft drink (such as Coke®)",
        "1 strip of lemon zest, for garnish"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Firebolt",
      "url": "http://allrecipes.com/recipe/106177/chinese-firebolt/"
    },
    {
      "id": "bf53a988-c81e-46d4-84de-feba6758d8e6",
      "category": "Meat",
      "image": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/22/51/07/picJaTlA0.jpg",
      "directions": [
        "Rinse chicken breasts and pat dry. Sprinkle with five-spice powder, garlic powder, salt and pepper. Wrap tightly in aluminum foil and refrigerate to 'marinate' for at least 2 hours.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Remove wrapping from chicken breasts and place them in a lightly greased 9x13 inch baking dish. Drizzle with olive oil and bake at 350 degrees F (175 degrees C) for 45 minutes, or until cooked through and juices run clear."
      ],
      "ingredients": [
        "2 whole bone-in chicken breasts, with skin",
        "2 teaspoons Chinese five-spice powder",
        "1 teaspoon garlic powder",
        "salt and pepper to taste",
        "1 tablespoon olive oil"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Five Spice Chicken",
      "url": "http://allrecipes.com/recipe/19120/chinese-five-spice-chicken/"
    },
    {
      "id": "bf53a988-c81e-46d4-84ee-feba6758d8e6",
      "category": "Desert",
      "image": "https://www.allrecipes.com/thmb/9PkDnBDqv8tVIK3GYjwYxnhJJyM=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/8817474-4104211a509a4d31af1c7f7bc18dcba0.jpg",
      "directions": [
        "Soak raisins in a bowl of warm water until plump, about 30 minutes. Drain and pat raisins dry with a towel.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Beat butter and both sugars with an electric mixer in a large bowl until smooth. Beat the first egg into the butter until completely blended; beat vanilla extract in with the second egg.",
        "Combine oats, flour, walnuts, coconut, five-spice powder, baking powder, cinnamon, and salt in a large bowl. Stir egg mixture into oat mixture until well mixed. Fold in raisins and mix until just incorporated.",
        "Drop rounded spoonfuls of dough 2 inches apart onto ungreased baking sheets.",
        "Bake in preheated oven until golden brown, 12 to 15 minutes."
      ],
      "ingredients": [
        "1 cup raisins",
        "1 cup butter, softened",
        "1 cup white sugar",
        "1 cup dark brown sugar, packed",
        "2 large eggs",
        "1 tablespoon vanilla extract",
        "2 cups quick cooking oats",
        "1 1/2 cups all-purpose flour",
        "1 cup chopped walnuts",
        "1/2 cup flaked coconut",
        "1 1/2 teaspoons Chinese five-spice powder",
        "1 teaspoon baking powder",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon salt"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Five-Spice Oatmeal Raisin Cookies",
      "url": "http://allrecipes.com/recipe/231446/chinese-five-spice-oatmeal-raisin-coo/"
    },
    {
      "id": "bf53a988-c81e-46d4-84fe-feba6758d8e6",
      "category": "Meat",
      "image": "https://www.allrecipes.com/thmb/eYsaEUWmUkP7laggotx2NE8qhVw=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/9248359-chinese-five-spice-spare-ribs-Apothecaryrx-4x3-1-7e66e65183344d698c66e1d4e9475c73.jpg",
      "directions": [
        "Combine soy sauce, white wine vinegar, sesame oil, honey, five-spice powder, garlic, and ginger in a large storage bag.  Shake to mix well.  Add ribs to marinade; refrigerate 4 to 8 hours, turning bag occasionally.",
        "Preheat an oven to 325 degrees F (165 degrees C). Remove ribs from marinade and place in a roasting pan; cover tightly with aluminum foil.",
        "Cook ribs for one hour, turning occasionally. Increase oven temperature to 400 degrees F. Remove foil from pan and bake an additional 20 minutes, turning once, until ribs are nicely browned."
      ],
      "ingredients": [
        "2 tablespoons soy sauce",
        "1 tablespoon white wine vinegar",
        "1 teaspoon sesame oil",
        "1 tablespoon honey",
        "1 teaspoon Chinese five-spice powder",
        "1/2 teaspoon minced garlic",
        "1/2 teaspoon ground ginger",
        "2 pounds pork short spareribs"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Five Spice Spare Ribs",
      "url": "http://allrecipes.com/recipe/204890/chinese-five-spice-spare-ribs/"
    },
    {
      "id": "bf53a988-c81e-46d4-856e-feba6758d8e6",
      "category": "Noodle",
      "image": "https://www.recipetineats.com/wp-content/uploads/2014/10/Chicken-Chow-Mein-2.jpg",
      "directions": [
        "Boil ramen noodles for 3 minutes, or until softened, without flavor packets. Reserve flavor packets. Drain noodles, and set aside.",
        "Heat 1 tablespoon oil in a small skillet. Scramble eggs in a bowl. Cook and stir in hot oil until firm. Set aside.",
        "In a separate skillet, heat 1 teaspoon of oil over medium heat. Cook and stir green onions in oil for 2 to 3 minutes, or until softened. Transfer to a separate dish, and set aside. Heat another teaspoon of cooking oil in the same skillet. Cook and stir the the carrots, peas, and bell peppers separately in the same manner, setting each aside when done.",
        "Combine 2 tablespoons sesame oil with 1 tablespoon of vegetable oil in a separate skillet or wok. Fry noodles in oil for 3 to 5 minutes over medium heat, turning regularly. Sprinkle soy sauce, sesame oil, and desired amount of reserved ramen seasoning packets over noodles, and toss to coat. Add vegetables, and continue cooking, turning frequently, for another 5 minutes."
      ],
      "ingredients": [
        "2 (3 ounce) packages Oriental flavored ramen noodles",
        "3 eggs, beaten",
        "vegetable oil",
        "4 green onions, thinly sliced",
        "1 small carrot, peeled and grated",
        "1/2 cup green peas",
        "1/4 cup red bell pepper, minced",
        "2 tablespoons sesame oil",
        "soy sauce"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Fried Noodles",
      "url": "http://allrecipes.com/recipe/34668/chinese-fried-noodles/"
    },
    {
      "id": "bf53a988-c81e-46d4-866e-feba6758d8e6",
      "category": "Appetizer",
      "image": "https://www.afamilyfeast.com/wp-content/uploads/2013/01/chinese_fried_walnuts.jpg",
      "directions": [
        "Place walnuts in a medium stock pot. Cover with water and boil for 2 minutes. Strain, but do not rinse. Transfer to a bowl, and toss with sugar while still hot until well coated.",
        "Heat 3 inches of oil in a large saucepan over medium-high heat. When oil appears to shimmer, fry 1 nut to test for heat. Nut should begin to sizzle immediately. Fry 1/3 batch of nuts at a time for 4 to 5 minutes uncovered. Toss nuts before each batch, and repeat. Using a slotted spoon, transfer each batch to a cookie sheet to cool. Season to taste with salt, and break apart when cool."
      ],
      "ingredients": [
        "1 pound shelled walnuts",
        "1 cup granulated sugar",
        "vegetable oil for frying",
        "salt to taste"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Fried Walnuts",
      "url": "http://allrecipes.com/recipe/48268/chinese-fried-walnuts/"
    },
    {
      "id": "bf53a988-c81e-46d4-876e-feba6758d8e6",
      "category": "Meat",
      "image": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/15/11/77/24mjE8nyQbBRydACUtdS_honey%20chicken%20SITE-2.jpg",
      "directions": [
        "Season chicken with salt and black pepper. Toss with flour until coated.",
        "Heat peanut oil in a wok or large skillet over high heat until it begins to smoke. Add chicken, and stir fry until the pieces are lightly browned on the outside, 3 to 5 minutes. Turn heat to medium and stir in whole garlic cloves; continue stir frying for 5 minutes.",
        "Turn heat to low, and add Shao-Hsing wine, soy sauce, and chicken stock. Cover, and simmer for 20 minutes until the chicken is tender. Remove garlic cloves before serving."
      ],
      "ingredients": [
        "1 ½ pounds skinless, boneless chicken breasts, cut into bite-size pieces",
        "1 teaspoon salt",
        "½ teaspoon black pepper",
        "2 tablespoons all-purpose flour",
        "2 tablespoons peanut oil",
        "15 cloves garlic, peeled",
        "3 tablespoons Shao-Hsing cooking wine or dry sherry",
        "2 tablespoons light soy sauce",
        "1 ⅓ cups chicken stock"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Garlic Chicken",
      "url": "http://allrecipes.com/recipe/141848/chinese-garlic-chicken/"
    },
    {
      "id": "bf53a988-c81e-86d4-876e-feba6758d8e6",
      "category": "Noodle",
      "image": "https://www.allrecipes.com/thmb/KLemayxISjJ_TntlspX5qtdcqcs=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/3860740-50f63b79af0943a3a319a739f83bb6ca.jpg",
      "directions": [
        "Soak the bean threads in a large bowl of hot water until soft, about 15 minutes; drain and cut into bite-size lengths. Divide the noodles into 4 bowls.",
        "Bring the chicken broth, garlic, ginger, and lemongrass to a boil in a large saucepan; reduce heat to medium-low and cook the mixture at a simmer until fragrant, about 15 minutes. Add the chicken and shrimp to the soup; simmer until the chicken pieces are cooked through, 3 to 5 minutes. Stir the lime juice and fish sauce through the soup. Ladle the soup over the noodles; top with jalapeno pepper slices and cilantro to serve."
      ],
      "ingredients": [
        "2 ounces uncooked bean threads (cellophane noodles)",
        "3 (14.5 ounce) cans chicken broth",
        "1 large clove garlic, minced",
        "2 tablespoons thin strips fresh ginger root",
        "4 2-inch pieces fresh lemongrass, minced",
        "2 skinless, boneless chicken breast halves, cut into 1/2-inch strips",
        "6 large shrimp, peeled and deveined",
        "2 tablespoons lime juice",
        "2 tablespoons fish sauce",
        "1 jalapeno pepper, cut into 8 thin slices",
        "1/4 cup chopped fresh cilantro"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Glass Noodle Soup",
      "url": "http://allrecipes.com/recipe/219780/chinese-glass-noodle-soup/"
    },
    {
      "id": "bf53a988-c81e-96d4-876e-feba6758d8e6",
      "category": "Vegetable",
      "image": "https://ohsnapletseat.com/wp-content/uploads/2020/11/green-beans-stir-fry-3-1200x900.jpeg.webp",
      "directions": [
        "In a large wok, heat oil over medium-high heat. Stir in green beans; cook, stirring frequently, for 1 to 2 minutes. Stir in garlic and ginger; cook, stirring frequently, for 3 to 4 minutes. Season with salt and pepper, and then stir in black bean sauce. Continue cooking until green beans are tender."
      ],
      "ingredients": [
        "1 cup vegetable oil",
        "13 pounds fresh green beans, trimmed",
        "5 tablespoons minced garlic",
        "5 tablespoons minced fresh ginger root",
        "2 tablespoons kosher salt",
        "1 tablespoon coarsely ground black pepper",
        "2 (8 ounce) bottles black bean sauce"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Green Bean Stir-Fry",
      "url": "http://allrecipes.com/recipe/49350/chinese-green-bean-stir-fry/"
    },
    {
      "id": "bf53a988-ca1e-86d4-876e-feba6758d8e6",
      "category": "Noodle",
      "image": "https://redhousespice.com/wp-content/uploads/2020/01/Hand-pulled-noodles-03-1367x2048.jpg",
      "directions": [
        "Place flour in a large bowl and gradually mix in water. Mix until dough comes together; knead until smooth, 15 to 20 minutes. Cover with plastic wrap and let rest for 15 minutes.",
        "Knead dough again for 2 minutes; cover and let rest for 15 minutes.",
        "Knead dough one more time for 2 minutes. Divide into 4 equal pieces. Roll each piece into a 1/3-inch-thick sheet. Brush both sides of each sheet with oil. Stack sheet together; cover with plastic wrap and let rest for 10 to 15 minutes.",
        "Fill a large saucepan with water and bring to the boil.",
        "Place one sheet of dough on a cutting board and slice into 1/8-inch-wide strips. Take one end of a strip in each hand and stretch it until it is 33 inches long. Fold it in thirds and stretch again to the same length; shake and slap against the counter several times to lengthen it to 6 1/2 feet. Drop it into the boiling water. Add 2 to 3 more strips of noodles to the boiling water; cook until tender, 5 to 10 minutes. Transfer drained noodles to a serving bowl.",
        "Repeat with remaining sheets of dough."
      ],
      "ingredients": [
        "8 cups all-purpose flour",
        "2 1/2 cups water",
        "1/4 cup vegetable oil"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Hand-Pulled Noodles",
      "url": "http://allrecipes.com/recipe/256982/chinese-hand-pulled-noodles/"
    },
    {
      "id": "bf53a988-cb1e-86d4-876e-feba6758d8e6",
      "category": "Meat",
      "image": "https://thecookingjar.com/wp-content/uploads/2013/09/2013-09-30-16.39.53-2-.jpg",
      "directions": [
        "Preheat an indoor grill, and coat with cooking spray. Place the chicken strips on the grill, and cook for about 7 minutes. Allow them to cool slightly, then cut into cubes.",
        "While the chicken is cooking, heat the oil in a large skillet over medium heat. Place the onion rings in the skillet, and cook for a few minutes. Add the red and yellow pepper, baby corn, and the stir-fry vegetables. Increase the heat to medium-high; cook and stir for about 15 minutes.",
        "Sprinkle in the sugar and salt. Stir in the chicken. Dissolve the cornstarch in water, and pour into the skillet along with the soy sauce. Cook and stir until the sauce thickens."
      ],
      "ingredients": [
        "3 skinless, boneless chicken breast halves - cut into strips",
        "2 tablespoons olive oil",
        "1 onion, sliced",
        "1 red bell pepper, seeded and cubed",
        "1 yellow bell pepper, seeded and cubed",
        "1 (15 ounce) can baby corn, drained",
        "1 tablespoon white sugar",
        "1 (16 ounce) package frozen stir-fry vegetables",
        "1 cup water",
        "1 tablespoon cornstarch",
        "1 tablespoon soy sauce"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Happy Family",
      "url": "http://allrecipes.com/recipe/81129/chinese-happy-family/"
    },
    {
      "id": "bf53a988-cc1e-86d4-876e-feba6758d8e6",
      "category": "Vegetable",
      "image": "https://mykoreankitchen.com/wp-content/uploads/2017/06/1.-Cucumber-Kimchi.jpg",
      "directions": [
        "Mix the cucumbers and sea salt together in a bowl, let stand for 30 minutes to let the cucumbers soften. Drain, and rinse with fresh water.",
        "While the cucumbers are standing in salt, whisk together the sugar, vinegar, and water in a saucepan; bring to a boil. Reduce heat, and stir in the chili bean sauce and hot chili oil.",
        "Mix the cucumbers with sliced chiles, onion, and garlic in a heatproof airtight container, and pour the hot vinegar mixture over the vegetables. Cover and refrigerate for 2 to 3 hours to blend the flavors. Serve chilled."
      ],
      "ingredients": [
        "5 cucumbers, peeled and cut into 1/2 x1 1/2 inch sticks",
        "1/2 cup sea salt",
        "1/2 cup white sugar",
        "1/2 cup white vinegar",
        "1 cup water",
        "2 tablespoons chili bean sauce (toban djan)",
        "1 tablespoon hot chili oil",
        "2 (4 inch) fresh hot red chile peppers, sliced",
        "1 small onion, sliced",
        "5 cloves garlic, sliced and crushed"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese-Korean Cucumber Kimchi",
      "url": "http://allrecipes.com/recipe/146589/chinese-korean-cucumber-kimchi/"
    },
    {
      "id": "bf53a988-cd1e-86d4-876e-feba6758d8e6",
      "category": "Soup",
      "image": "https://www.allrecipes.com/thmb/96UucNHsVsYfJMsCYJOOsV3wCKc=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/666788-2c84d59f69d24c3493f9cb5ce2b8ad6d.jpg",
      "directions": [
        "Mix the ground pork, egg, cornstarch, 2 teaspoons of sesame oil, ginger, monosodium glutamate, salt, and half of the chopped green onions together in a bowl. Use your hands to mix until the ingredients are evenly distributed. Set aside.",
        "Heat the vegetable oil in a wok or large skillet over high heat. When the oil is hot, fry the napa cabbage, stirring constantly, until cabbage begins to wilt, 2 to 3 minutes. Pour in the chicken broth, water, and soy sauce. Bring to a boil, then lower the heat to medium.",
        "Use a spoon to form the meat mixture into 1 inch balls. Drop them into the boiling soup. When the last ball has been added, cover with a lid and simmer for 10 minutes. Taste, and adjust salt before serving. Garnish with remaining green onions and a drizzle of sesame oil."
      ],
      "ingredients": [
        "1 pound ground pork",
        "1 egg",
        "1 tablespoon cornstarch",
        "2 teaspoons sesame oil",
        "1 tablespoon minced fresh ginger root",
        "1/4 teaspoon monosodium glutamate (MSG) (optional)",
        "1 teaspoon salt",
        "2 green onions, chopped and divided",
        "1 tablespoon vegetable oil",
        "1 head napa cabbage, cored and cut into chunks",
        "2 cups low-sodium chicken broth",
        "2 cups water, or as needed",
        "1 tablespoon soy sauce",
        "2 teaspoons sesame oil"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Lion's Head Soup",
      "url": "http://allrecipes.com/recipe/135367/chinese-lions-head-soup/"
    },
    {
      "id": "bf53a988-ce1e-86d4-876e-feba6758d8e6",
      "category": "Meat",
      "image": "https://thewoksoflife.com/wp-content/uploads/2019/06/mapo-tofu-10.jpg",
      "directions": [
        "Mix cornstarch and water in a small bowl; set aside.",
        "Brown ground pork in a small skillet over medium-high heat, about 5 minutes. Drain fat.",
        "Heat the vegetable oil over medium-high heat in a large skillet or wok. Cook the garlic and ginger root in the oil until fragrant, about 1 minute. Stir in tofu and cook for 2 minutes. Season with the soy sauce, hot bean sauce, and sugar; stir to combine.",
        "Stir in the cooked pork and green onion. Sprinkle with the cornstarch and water mixture; cook and stir until thickened, about 2 minutes. Stir the sesame oil into the thickened mabo tofu."
      ],
      "ingredients": [
        "1 teaspoon cornstarch",
        "1 tablespoon cold water",
        "1/2 pound ground pork",
        "1 tablespoon vegetable oil",
        "1 tablespoon minced garlic",
        "1 tablespoon minced fresh ginger root",
        "1 (16 ounce) package firm tofu, cut into 1 inch pieces",
        "5 tablespoons soy sauce",
        "2 tablespoons hot bean sauce",
        "1 teaspoon white sugar",
        "3 green onions, chopped",
        "1 teaspoon sesame oil"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Mapo Tofu",
      "url": "http://allrecipes.com/recipe/164254/chinese-mabo-tofu/"
    },
    {
      "id": "bf53a988-cf1e-86d4-876e-feba6758d8e6",
      "category": "Meat",
      "image": "https://www.chinasichuanfood.com/wp-content/uploads/2022/12/braised-tofu-with-minced-pork-11.webp",
      "directions": [
        "In a bowl, mix the ground pork with the soy sauce, sesame oil, sugar, cornstarch, black pepper, and red pepper flakes. Marinate at least 10 minutes.",
        "Place the tofu in a microwave-safe dish. Place the pork over the tofu. Discard any remaining marinade. Top with green onion, carrots, and chile pepper. Cover with microwave-safe plastic wrap. Cut a small slit in the plastic wrap to vent steam.",
        "Cook 5 minutes on High in the microwave, or until vegetables are tender and pork is cooked to desired doneness."
      ],
      "ingredients": [
        "3/4 cup ground pork",
        "1 teaspoon soy sauce",
        "1 teaspoon sesame oil",
        "1/2 teaspoon white sugar",
        "1 teaspoon cornstarch",
        "1 dash ground black pepper",
        "1 dash crushed red pepper flakes",
        "1 (14 ounce) package tofu, drained",
        "1 green onion, chopped",
        "1 tablespoon chopped carrots",
        "1 chile pepper, chopped"
      ],
      "language": "en-US",
      "source": "allrecipes.com",
      "tags": [],
      "title": "Chinese Microwaved Tofu with Minced Pork",
      "url": "http://allrecipes.com/recipe/74713/chinese-microwaved-tofu-with-minced-p/"
    }
]
